[{"ru_bio":"The Grugq — это выдающийся исследователь в области ИБ с профессиональным опытом более 10 лет. Он усиленно работал с forensic анализом, binary reverse engineering, руткитами, VoIP, телекоммуникациями и финансовой безопасностью. Его профессиональная карьера включает в себя работу в компаниях из Fortune 100, ведущих фирм по ИБ и инновационных стартапов. Живя в Тайланде, он работает в должности старшего исследователя по ИБ в компании COSEINC. В свободное от работы время продолжает свои исследования в сфере безопасности, экспертиз и пива. \n\nЗнаменит:\nввел понятие anti-forensics;\nразработал «userland exec»;\nвыпустил ПО для атак на VoIP;\n10 лет опыта в сфере ИБ;\nдолгосрочные отношения с компьютерным андеграундом;\nописан как «ужасно привлекательный» (по мнению мамы);\n1992 — гонки на 3х ногах, 2-е место.\nThe Grugq был докладчиком на 12 конференциях за прошедшие 7 лет; проводил курсы подготовки экспертов для государственных органов, армии, полиции и финансовых систем.","ru_name":"The Grugq","id":1,"name":"The Grugq","bio":"The Grugq is a pioneering information security researcher with over a decade of professional experience. He has worked extensively with digital forensic analysis, binary reverse engineering, rootkits, Voice over IP, telecommunications and financial security. The Grugq's professional career has included Fortune 100 companies, leading information security firms and innovative start-ups.\n\nCurrently living in Thailand, the Grugq works as a senior security researcher for COSEINC. While not on engagements, the Grugq continues his research on security, forensics and beer.\n\nClaims to fame:\npioneered anti-forensics;\ndeveloped “userland exec”;\nreleased voip attack software;\ndecade of experience in info sec;\nlong term liaison with digital underground;\ndescribed as “extremely handsome” [by his mom];\n1992 sussex County 3-legged race, 2nd place.","talk":4,"photo":"Grugq.jpg"},{"ru_bio":"Felix 'FX' Lindner работает в Recurity Labs. FX имеет опыт более 10 лет в области компьютерной индустрии и 8 из них посвятил консалтингу для крупных телекоммуникационных и крупных компаний. Он обладает обширными познаниями в области компьютерных наук, технологий телекоммуникации и разработки программного обеспечения. Его опыт включает в себя управление и участие в различных проектах связанных с безопасностью планирования, внедрения, эксплуатации и тестирования, с использованием передовых методик и в различных технических условиях. FX хорошо известен в сообществе компьютерной безопасности, и представил его и исследований в области безопасности Phenoelit на Black Hat, CanSecWest, PacSec, DEFCON, Chaos Communication Congress, MEITSEC и многих других мероприятиях. Темы его исследований связанны с Cisco IOS, принтерами HP, SAP и RIM BlackBerry. Феликс имеет сертификаты CISSP и государственный сертификат технического ассистента по информатике и информационным технологиям. ","ru_name":"Felix 'FX' Lindner","id":2,"name":"Felix 'FX' Lindner","bio":"Felix 'FX' Lindner runs Recurity Labs. FX has over 10 years of experience in the computer industry, eight of them in consulting for large enterprise and telecommunication customers. He possesses a vast knowledge of computer sciences, telecommunications and software development. His background includes managing and participating in a variety of projects with a special emphasis on security planning, implementation, operation and testing using advanced methods in diverse technical environments. FX is well known in the computer security community and has presented his and Phenoelit's security research on Black Hat Briefings, CanSecWest, PacSec, DEFCON, Chaos Communication Congress, MEITSEC and numerous other events. His research topics included Cisco IOS, HP printers, SAP and RIM BlackBerry. Felix holds a title as State-Certified Technical Assistant for Informatics and Information Technology as well as Certified Information Systems Security Professional","talk":32,"photo":"fx.jpg"},{"ru_bio":"Андрей Беленко — cтарший аналитик информационной безопасности и разработчик ПО компании «Элкомсофт». Один из разработчиков технологии Thunder Tables — усовершенствованной версии радужных таблиц. Первым использовал ускорение графического процессора (GPU) для восстановления паролей. Магистр информационных технологий и обладатель сертификата CISSP. Старший инженер по ИБ в viaForensics.","ru_name":"Андрей Беленко","id":3,"name":"Andrey Belenko","bio":"ndrey Belenko is the Chief security researcher and software developer at Elcomsoft. Co-invented Thunder Tables (which are improved rainbow tables) and was first to bring GPU acceleration to password recovery. M. Sc. IT and CISSP. Sr. Security Engineer at viaForensics.","talk":47,"photo":"belenko.jpg"},{"ru_bio":"Дмитрий Скляров — ведущий аналитик компании Positive Technologies и бывший аналитик информационной безопасности компании ElcomSoft Co. Ltd. Доцент кафедры информационной безопасности в МГТУ им. Н.Э. Баумана. Автор исследований по безопасности электронных книг и надежности методов обеспечения подлинности цифровых фотографий. Один из разработчиков технологии ElcomSoft iOS Forensic Toolkit.","ru_name":"Дмитрий Скляров","id":4,"name":"Dmitry Sklyarov","bio":"Dmitry Sklyarov is a lead analyst in Positive Technologies and formerly an analyst with the information security company ElcomSoft Co. Ltd. Associate Professor of information security of MSTU N.E. Bauman. The author of studies in the security of e-books and reliability of methods to ensure the authenticity of digital photos. One of the developers of technology ElcomSoft iOS Forensic Toolkit.","talk":47,"photo":"sklyarov.jpg"},{"ru_bio":"Atte Kettunen — исследователь ИБ из группы безопасного программирования Университета Оулу (Oulu University Secureamming Group — OUSPG). В 2011 и 2012 им был удачно проведен фаззинг Firefox и Chromium. В результате была обнаружена дюжина уязвимостей — это позволило автору оказаться лидером программы по обнаружению уязвимостей от обоих производителей.","ru_name":"Atte Kettunen","id":5,"name":"Atte Kettunen","bio":"Atte Kettunen is a security researcher at the Oulu University Secure Programming Group (OUSPG). In 2011 and 2012 he has successfully fuzzed Firefox and Chromium and found dozens of vulnerabilities in them. Atte has quickly become one of the top reporters in both browsers' bug bounty programs.","talk":24,"photo":null},{"ru_bio":"Miaubiz является разработчиком и независимым исследователем ИБ, который обнаружил более 50 уязвимостей в WebKit за прошедшие два года. В свободное время собирает четырехлистный клевер.","ru_name":"Miaubiz","id":6,"name":"Miaubiz","bio":"Miaubiz is a software developer and independent security researcher who has found over 50 security vulnerabilities in WebKit in the past two years. In his spare time he collects four leaf clovers.","talk":24,"photo":null},{"ru_bio":"Alberto Garcia Illera (Испания) — 24-летний энтузиаст информационной безопасности и особенно социальной инженерии. Изучал математику и компьютерные системы в Испании. С тех пор много лет работает пентестером. Выступал на множестве обучающих семинаров по техникам взлома для крупных компаний, таких как Microsoft, правительство Испании, отдел кибертерроризма испанской полиции, а также на DEFCON. В настоящее время работает над исследованием криптографических хэш-функций в контексте IT-безопасности.","ru_name":"Alberto Garcia Illera","id":7,"name":"Alberto Garcia Illera","bio":"Alberto Garcia Illera (Spain, Security bussines) — He is a 24 year old passionate about the hacking and especially for social engineering. He studied mathematics and computer systems in Spain. He works since several years like professional pentester. He has spoken in several seminars teaching hacking technics to help big companies like Microsoft, Spanish government or ciberterrorism Spanish police department. He is actually making a study about cryptographic hash functions applied to the IT security. He spoke at DEFCON20 in trak 1.","talk":6,"photo":"illera.jpg"},{"ru_bio":"Владимир Воронцов — основатель и ведущий эскперт компании ONsec. Занимается исследованиями в области безопасности веб-приложений с 2004 года. Руководитель и ведущий эксперт компании ONsec. Автор множества исследований в области безопасности веб-приложений. Награжден Яндекс за победу в конкурсе “месяц поиска уязвимостей”, Google за уязвимости браузера Chrome, Trustwave за ModSecurity SQLi Challenge, 1C Битрикс за конкурс по обходу проактивной защиты и многих других. В настоящее время активно занимается разработкой системы web application firewall.","ru_name":"Владимир Воронцов","id":8,"name":"Vladimir Vorontsov","bio":"Vladimir Vorontsov is the founder and lead analyst of ONsec. Vladimir has been engaged in research in the field of web applications security since 2004. He is the CEO and lead expert of the ONsec company as well as the author of numerous researches in the field of web application security. He was awarded by Yandex for winning the \"vulnerability search month\" contest, by Google for Chrome vulnerabilities, by Trustwave for ModSecurity SQLi Challenge, by 1C Bitrix for competition on proactive defense bypass. He is currently actively engaged in the development of a web application firewall system.","talk":39,"photo":"vorontsov.jpg"},{"ru_bio":"Александр Головко","ru_name":"Александр Головко — ведущий эксперт компании ONsec.","id":9,"name":"Alexander Golovko","bio":"Alexander Golovko — lead expert of ONsec","talk":39,"photo":"golovko.jpg"},{"ru_bio":"Андрей родился и вырос в Молдавии и закончил факультет вычислительной техники в Политехническом университете Бухареста, где занимался научной работой в области биометрических технологий и обработки изображений. Он начал свою карьеру в сфере разработки компьютерных игр, но также работал в области телекоммуникаций и был старшим разработчиком в фирме, специализирующейся на программировании разнообразных подсистем GSM/UMTS/GPS. Он является автором MiFare Classic Universal toolKit (MFCUK), первого публично доступного инструмента взлома ключей для семейства карт MiFare Classic RFID, а также получил кличку «Мистер Принтер» за свою серию докладов, посвященную взлому МФУ и PostScript, на различных международных конференциях. Он – энтузиаст безопасности в самом широком и глобальном ее понимании. Сейчас он готовится к получению степени PhD в институте EURECOM в области безопасности встроенных устройств. ","ru_name":"Андрей Костин","id":10,"name":"Andrei Costin","bio":"Born and grown-up in Moldova, Andrei is a Computer Science graduate of the Polytechnic University of Bucharest where he did his thesis work in Biometrics and Image Processing. While starting out his IT-career in the Computer Games industry, he has worked in the Telecom field and also was a senior developer at a specialized firm programming various GSM/UMTS/GPS sub-systems. He is the author of the MiFare Classic Universal toolKit (MFCUK), the first publicly available (FOSS) card-only key cracking tool for the MiFare Classic RFID card family and is known as the “mister-printer guy” for his “Hacking MFPs” and “Hacking PostScript” series of hacks & talks at various international conferences. He is passionate about security in a holistic and broad-view fashion. Currently he is a PhD candidate with EURECOM in field of “Security of embedded devices”. ","talk":7,"photo":"kostin.jpg"},{"ru_bio":"joernchen любит читать. Особенно он любит читать исходные коды других людей, а также изучать интересные бинарные данные в надеже расширить функционал исследуемой системы до неожиданных пределов. ","ru_name":"joernchen из Phenoelit","id":11,"name":"joernchen of Phenoelit","bio":"joernchen likes to read. His main points of interest are in enjoying the reading of other people’s source code, as well as the inspection of interesting binary data in order to extend given systems functionality to unexpected limits.","talk":38,"photo":"joernchen.jpg"},{"ru_bio":"Michele \"antisnatchor\" Orru — ИТ-специалист из Италии. Мишель — ведущий разработчик BeEF, его исследования в основном сосредоточены в области безопасности приложений и связанных с ней методов эксплуатации. Он часто выступает на хакерских конференциях, таких как CONFidence, DeepSec, Hacktivity, SecurityByte, AthCon, HackPra, OWASP, 44Con, Ruxcon и многих других, которые мы не можем здесь упоминать. \n\nПомимо страсти к хакерству и работы в должности «старшего паука» (в Trustwave SpiderLabs), он любит иногда оставить свой Mac в покое, порыбачить в морской воде и помолиться о воскрешении Стенли Кубрика. ","ru_name":"Michele \"antisnatchor\" Orru,","id":12,"name":"Michele \"antisnatchor\" Orru","bio":"Michele Orru a.k.a. antisnatchor is an IT and ITalian security guy. Lead core developer of the BeEF project, he mainly focuses his research on application security and related exploitation techniques. He is a frequent speaker at hacking conferences, including CONFidence, DeepSec, Hacktivity, SecurityByte, AthCon, HackPra, OWASP, 44Con, Ruxcon and more we just can't disclose. Besides having a passion for hacking and being a Senior Spider (for Trustwave SpiderLabs), he enjoys leaving his Mac alone, whilst fishing on salted water and praying for Kubrick's resurrection. \n","talk":29,"photo":"antisnatchor.jpg"},{"ru_bio":"В 2008 году закончил ПГУ им. Ломоносова по специальности «Прикладная математика и информатика». С 2009 года работает вирусным аналитиком в компании ООО «Доктор Веб». Начиная с 2011 года, стал специализироваться по угрозам для операционной системы Mac OS X. ","ru_name":"Иван Сорокин","id":13,"name":"Ivan Sorokin","bio":"In 2008, graduated from Lomonosov Pomor State University with a degree in Applied Mathematics and Computer Science. Since 2009 has been employed as a malware analyst at Doctor Web. Since 2011 has been specializing in threats for Mac OS X. ","talk":23,"photo":"sorokin.jpg"},{"ru_bio":"Mohamed Saher — старший исследователь безопасности, специалист по обратной инженерии, внутренностям Windows и математике. Его работы и исследования затрагивают множество областей, включая защиту ПО производителем, технологии защиты от копирования, компиляторы и руткиты. Примеры его публичных исследований: «Взлом онлайн-игр (Взлом протокола безопасного обмена данными KONAMI и эмуляция игровых серверов)», «Целевые руткиты для промышленных систем контроля (ICS): свободно распространяемое ПО для обнаружения Stuxnet и DuQu», обратная инженерия исходных кодов на C с базами данных IDA. В свободное время общается на разнообразных форумах, посвященных обратной инженерии, а также решает задачки по математике и взлому в рамках Project Euler, где он имеет высокие рейтинги как на национальном, так и на интернациональном уровне. Сейчас Мохамед работает в NSS Labs. ","ru_name":"Mohamed Saher","id":14,"name":"Mohamed Saher","bio":"Mohamed Saher is a Senior Security Researcher specializing in reverse engineering, windows internals and mathematics. His work and research spans numerous areas, including native software protection, copy protection technologies, compilers and rootkits. Examples of his public research includes: Hacking Online Games (Breaking KONAMI’s Secure Communication Protocol and Emulating Game Servers), Industrial Control Systems (ICS) Targeted Rootkits: Stuxnet, DuQu open-source detector, and reverse engineered C sources with IDA databases. In his spare time he enjoys contributing to various reverse engineering forums and solving crackmes and math problems in Project Euler where he is top-ranked nationally and internationally. Mohamed currently works for NSS Labs.","talk":21,"photo":null},{"ru_bio":"Cтудент 5-го курса ВМиК МГУ, исследования посвящены детектированию вредоносного Flash-контента, в котором реализованы методы противодействия обнаружению; участник CTF-команды Bushwhackers; носит усы. ","ru_name":"Кирилл Самосадный","id":15,"name":"Kirill Samosadny","bio":"A fifth year student of Lomonosov Moscow State University, Faculty of Computational Mathematics and Cybernetics, he dedicates his research to methods of detection-proof malicious Flash content detection; is a member of the Bushwhackers CTF team; sports a moustache. ","talk":54,"photo":"samosadny.jpg"},{"ru_bio":"Специалист группы анализа защищенности веб-приложений компании Positive Technologies, автор ряда исследований и публикаций в области информационной безопасности, автор популярного тематического блога raz0r.name. Специализируется в вопросах безопасности приложений, тестировании на проникновение, анализе веб-приложений и исходного кода. Призер конкурса $natch на Positive Hack Days 2012. Входит в команду исследовательского центра Positive Research.","ru_name":"Арсений Реутов","id":16,"name":"Arseny Reutov","bio":"Specialist of Positive Technologies web application security research group, author of a range of infosecurity researches and whitepapers, author of a popular blog called raz0r.name. Specializes in application security, penetration testing, web application and source code analysis. Got a reward at the $natch contest at Positive Hack Days 2012. Member of the Positive Research center team.","talk":64,"photo":"reutov.jpg"},{"ru_bio":"Специалист группы анализа защищенности веб-приложений компании Positive Technologies, автор ряда исследований и публикаций в области информационной безопасности. Специализируется в вопросах безопасности приложений, тестировании на проникновение, анализе веб-приложений и исходного кода. Один из разработчиков PHDays CTF. Входит в команду исследовательского центра Positive Research.","ru_name":"Тимур Юнусов","id":17,"name":"Timur Yunusov","bio":"Specialist of Positive Technologies web application security research group, author of a range of infosecurity researches and whitepapers. Specializes in application security, penetration testing, web application and source code analysis. One of the developers of PHDays CTF. Member of the Positive Research center team.","talk":64,"photo":"yunusov.jpg"},{"ru_bio":"Специалист группы тестирования на проникновение отдела анализа защищенности компании Positive Technologies. Входит в команду исследовательского центра Positive Research.","ru_name":"Дмитрий Нагибин","id":18,"name":"Dmitry Nagibin","bio":"Specialist of Positive Technologies security analysis department, penetration testing group. Member of the Positive Research center team.","talk":64,"photo":"nagibin.jpg"},{"ru_bio":"Александр Матросов — директор Центра вирусных исследований и аналитики, ESET. В 2007 году окончил национальный исследовательский ядерный университет МИФИ по специальности «Комплексное обеспечение информационной безопасности автоматизированных систем. В дальнейшем Александр работал исследователем в области защиты информации в крупных российских IT-компаниях. В настоящее время г-н Матросов является директором центра вирусных исследований и аналитики, компании ESET. Основное направление профессиональной деятельности: исследование сложных угроз и автоматизация процесса обратного анализа. Александр автор многочисленных публикаций и исследований не только в России, но и за рубежом по тематике исследования наиболее интересных и сложных угроз (Stuxnet, TDL3, TDL4, Carberp, ZeroAccess). Докладчик на известных зарубежных практических конференциях, таких как CONFidence, CARO, AVAR, Virus Bulletin, Ekoparty и REcon. В качестве хобби им был разработан авторский учебный курс «Защита программного обеспечения», который преподается на кафедре криптологии и дискретной математики НИЯУ МИФИ. А так же Александр является бессменным ведущим 100% Virus Free Podcast.","ru_name":"Александр Матросов","id":19,"name":"Aleksandr Matrosov","bio":"Aleksandr Matrosov has more than ten years of experience with malware analysis, reverse engineering and advanced exploitation techniques. Currently working at ESET as Senior Malware Researcher and Security Intelligence Team Lead since joining the company in October 2009 as a virus researcher, and working remotely from Russia. He has worked as a security researcher since 2003 for major Russian companies. He is also a Lecturer at the Cryptology and Discrete Mathematics department of the National Research Nuclear University in Moscow, and co-author of the research papers “Stuxnet Under the Microscope” and “The Evolution of TDL: Conquering x64”, and is frequently invited to speak at major security conferences (including Ekoparty, REcon and Virus Bulletin). Nowadays he specializes in the comprehensive analysis of complex threats, modern vectors of exploitation, RE automation and research of cyber crime activity.","talk":22,"photo":"Matrosov.png"},{"ru_bio":"Евгений Родионов в 2009 году с отличием окончил Московский Инженерно-Физический Институт факультет «Информационная Безопасность» и в 2012 году успешно защитил диссертацию на соискание ученой степени кандидата технических наук. Имеет опыт работы в таких областях как разработка ПО, аудит ИБ и анализ вредоносного кода. В настоящее время Евгений работает в компании “ESET”, где занимается анализом сложных угроз. Круг интересов Евгения Родионова включает в себя разработку драйверов режима ядра, антируткит технологии, reverse engineering и крпитологию. Евгений является соавтором таких работ как “Stuxnet Under the Microscope” и “The Evolution of TDL: Conquering x64”, а так же докладчиком на ведущих международных конференциях в сфере защиты информации. Преподавательская деятельность г-на Родионова связана с чтением лекций и проведением семинаров посвященных матметическим методам обеспечения информационной безопасности.","ru_name":"Евгений Родионов","id":20,"name":"Eugene Rodionov","bio":"Eugene Rodionov graduated with honors from the Information Security faculty of the Moscow Engineer-Physics Institute (State University) in 2009 and successfully defended Ph.D. thesis in 2012. He has been working in the past five years for several companies, performing software development, IT security audit and malware analysis. He currently works at ESET, one of the leading companies in the antivirus industry, where he performs in-depth analysis of complex threats. His interests include kernel-mode programming, anti-rootkit technologies, reverse engineering and cryptology. He is co-author of the research papers “Stuxnet Under the Microscope” and “TDL3: The Rootkit of All Evil?”. Eugene Rodionov also holds the position of Lecturer at the National Nuclear Research University MEPHI in Russia.","talk":22,"photo":"rodionov.jpg"},{"ru_bio":"Работал техническим специалистом в компании Esage Lab. Один из сооснователей первого московского хакспейса Neuron. В настоящий момент занимается исследованиями в области уязвимостей и вредоносного кода в качестве хобби. ","ru_name":"Олексюк Дмитрий (aka Cr4sh)","id":21,"name":"Oleksiuk Dmytro (aka Cr4sh)","bio":"Worked as a technician for Esage Lab. One of the cofounders of Neuron, the first Moscow hackspace. Currently engaged in the research of vulnerabilities and malware (as a hobby). ","talk":18,"photo":null},{"ru_bio":"Алексей Синцов является малоизвестным и скромным деятелем сферы ИБ; вы могли помнить его по статьям в журнале «Хакер» или его эксплойтам (например, если читали “Gray Hat Hacking: The Ethical Hacker’s Handbook”). Также вы могли встречать его на различных конференциях, таких как BlackHat, CONFidence или Hack In The Box, где Алексей имел честь читать свои доклады. Но даже если нет — не печальтесь, ведь его всегда можно встретить на конференции ZeroNights, со-организатором которой он и является. \n\nЕсли уж мы начали говорить о его организаторских талантах, то стоит отметить, что именно Алексей вместе со своими друзьями (ага, почему в биографии не может быть друзей, пусть будут: Дима 'D1g1' Евдокимов и Алексей 'GreenDog' Тюрин) организовал первую в России коммунити-группу Defcon — Defcon Russia (DCG 7812). Свою карьеру он начал еще в школе, осознав всю безалаберность разработчиков Perl; это увлечение повлияло на выбор университета. Да, Алексей закончил питерский Политех и считает, что те, кто прошел «проверку на дурака» от Семьянова П.В. (http://www.password-crackers.com/) с первой попытки (например, как наш герой, чем он и горд), могут начинать ИБ карьеру без проблем. \n\nПродолжая расхваливать таланты Алексея и набивать ему цену, я (неизвестный современник и личный биограф Алексея) далее повествую о его судьбе, а вернее, профессиональном опыте: именно этот человек работал в грозной компании Digital Security, где и отметился, обнаружив многочисленные 0-day уязвимости не только в творениях буржуазных фирм: SAP, VMware, IBM, Adobe, Google, но и в отечественных системах ДБО, чем навел немалый ужас и стыд на российский сектор ИБ. Также Алексею в 2011 году удалось получить второе место на конкурсе от компании Yandex, сокрушив почтовый сервис во имя поддержки отечественного производителя и жажды наживы. И хотя второе место — это тоже проигрыш, все же Алексей был счастлив, ибо благополучно потратил призовые деньги на 0,000001% ипотеки. Ну а большую часть своих фолловеров в твиттере (https://twitter.com/asintsov) он получил, опубликовав мануал о том, как легко писать шеллкоды под JIT-компиляторы ActionScript (Flash) и JavaScript (Safari). В данный момент Алексей трудится на благо самой доброй компании в мире – Nokia, где служит истинным жизненным ценностям добра и справедливости. Некоторые продукты его деятельности вы можете найти тут: http://www.exploit-db.com/author/?a=549 ","ru_name":"Алексей Синцов","id":22,"name":"Alexey Sintsov","bio":"Alexey Sintsov is a modest and unrenowned infosec character; you probably remember his articles in the “][akep” magazine or his exploits (like if you’ve read “Gray Hat Hacking: The Ethical Hacker’s Handbook”). You can also have met him at various conferences like BlackHat, CONFidence, and Hack in the Box, where Alexey has had the honor to speak. But if you have not, take it easy: you can always catch up with him at the ZeroNights conference, which he co-organizes. \n\nSpeaking about his organizing talents, we have to mention that it was Alexey and his friends (well, why don’t we mention friends in the biography, too: Dmitriy 'D1g1' Evdokimov and Alexey 'GreenDog' Tyurin) who organized the first Defcon community group in Russia (DCG 7812). His career started back in school when Alexey realized all the negligence of Perl developers; this infatuation affected the choice of university. Yes, Alexey graduated the Saint Petersburg Polytechnic and he thinks that those who passed the “idiot check” of Mr. Semyanov (http://www.password-crackers.com/) on their first try (like our hero, who is quite proud about it) can start an infosec career with no sweat. \n\nTo continue praising Alexey’s talents and inflating his reputation, I (an unknown contemporary and Alexey’s personal biographer) follow the story of his fate or, more precisely, of his professional experience: he was the man to work for the mighty ERPScan company, where he got his 15 minutes of fame by finding numerous 0-day vulnerabilities in the software of giant vendors like SAP, VMware, IBM, Adobe, Google as well as in Russian remote banking systems, thus inflicting great horror and shame over the Russian infosec field. In 2011, Alexey was also rewarded by Yandex for crushing the mail service in the name of supporting the domestic producer (and lust for money). Although the second place in a contest can be considered a loss, Alexey was happy to spend his reward on 0.000001% of his mortgage. As for the majority of his followers on Twitter (https://twitter.com/asintsov), he got them after he published a manual about writing JIT-Spray shellcode for fun and profit under ActionScript (Flash) and JavaScript (Safari). Currently, Alexey dedicates his labor to the kindest company in the world: Nokia, where he tends to the true values of goodness and justice. Some fruits of his labor can be found here: http://www.exploit-db.com/author/?a=549 ","talk":60,"photo":"Sintsov.jpg"},{"ru_bio":"Закончил с отличием кафедру Информационной Безопасности Компьютерных Систем факультета технической кибернетики Санкт-Петербургского Государственного Политехнического Университета. На протяжении последних лет занимается внедрением процессинга банковских карт в компании OpenWay. Имеет опыт исследований безопасности средств электронной коммерции, виртуализации и сетевых технологий, реверс-инжиниринга для embedded и мобильных платформ. Активно участвует в жизни Russian DefCON Group. ","ru_name":"Никита Абдуллин","id":23,"name":"Nikita Abdullin","bio":"Nikita Abdullin graduated with honors from the Department of Information Security, Faculty of Engineering Cybernetics, Saint-Petersburg State Technical University.During the last few years he has been engaged in implementing payment card management system at OpenWay. He has research experience in e-commerce security, virtualization security, network technologies and reverse engineering of mobile and embedded platforms. Nikita is also an active participant of Russian DefCON Group","talk":11,"photo":"abdullin.jpg"},{"ru_bio":"Аналитик по безопасности, P1 Security, PhD candidate, Академия Синика, Тайвань \n\nРанее — аналитик по ИБ и со-основатель GuardInfo, консалтинговой компании в Тайванe. Часто выступает на международных конференциях по безопасности, включая BlackHat HK/Singapore, Hack in the Box, DeepSec, и, в первую очередь, специализируется на анализе инцидентов сетевой безопасности, экспертизе и исследовании уязвимостей. Федор имеет степень магистра в области компьютерных наук (Киргизо-Славянский Российский Университет), PhD Candidate в Национальном Университете Тайваня.","ru_name":"Федор Ярочкин","id":24,"name":"Fyodor Yarochkin","bio":"Security analyst, P1 Security; PhD candidate, Academia Sinica, Taiwan \n\nFormerly, security analyst and co-founder of GuardInfo, a Taiwan based security consulting company. He is a frequent speaker at international security conferences, including BlackHat HK/Singapore, Hack in the Box, DeepSec and primarily specializes on network security incidents analysis, forensics and vulnerability research. Fyodor has a MS degree in computer science from Kyrgyz Russian Slavic University and currently is a PhD Candidate at National Taiwan University.","talk":57,"photo":"fyod.jpg"},{"ru_bio":"В 2003 году с отличием окончил Рязанскую Государственную Радиотехническую Академию по специальности «Организация и Технология Защиты Информации». В 2004–2008 обучался в аспирантуре МГТУ имени Н.Э. Баумана, занимался исследовательской работой в области защиты информации. Регулярно выступает с докладами на профильных конференция по ИБ. В данный момент является сотрудником компании «РН-Информ», занимается мониторингом и реагированием на угрозы ИБ.","ru_name":"Владимир Кропотов","id":25,"name":"Vladimir Kropotov","bio":"In 2003, graduated from Ryazan State Radio engineering Academy with honors, faculty “Information security organization and technology”. From 2004 to 2008 – postgraduate study in MSTU of N.E. Bauman, where he was engaged in research work in the field of information security. He is a regular speaker at infosec conferences. At present, he is an employee of RN-inform, engaged in infosec threat monitoring and response.","talk":57,"photo":"kropotov.jpg"},{"ru_bio":"Выпускник Рязанского Государственного Радиотехнического Университета (РГРТУ), cпециальность «Компьютерная безопасность». В 2010–2011 годах работал на кафедре информационной безопасности РГРТУ, занимался развертыванием и поддержкой систем защиты информации. С 2012 года является сотрудником отдела информационной безопасности компании «ТБинформ».","ru_name":"Виталий Четвертаков","id":26,"name":"Vitaly Chetvertakov","bio":"Graduated Ryazan State Radio engineering Academy, faculty “Computer Security”. In 2010–2011, worked at the information security chair of Ryazan State Radio engineering Academy, where he was engaged in deployment and support of information security systems. Since 2012, he is an employee of information security department in TBinform.","talk":57,"photo":"chetvertakov.jpg"},{"ru_bio":"спирант Института системного анализа и управления. \n\nВ настоящее время занимается разработкой программного-аппаратного комплекса для реактора в Объединенном институте ядерных исследований. \n\nС 2002 года увлечён темой информационной безопасности. С 2010 года сфокусирован на ковырянии бесконтактных/смарт-карт и реверс-инжиниринге протоколов. \n\nПо совместительству прожженный спортсмен-экстремал.","ru_name":"Кирилл Саламатин (aka Del)","id":27,"name":"Kirill Salamatin (aka Del)","bio":"PhD student in the Institute for System Analysis and Management. Currently engaged in developing software and hardware for a reactor in the Joint Institute for Nuclear Research. \n\nInvolved in infosec since 2002. Focused on poking around contactless and smart cards and reverse engineering protocols since 2010. On top of that, a seasoned extreme sports enthusiast.","talk":30,"photo":"salamatin.jpg"},{"ru_bio":"Обладатель красного диплома журфака с красивым номером :) \n\nЛюблю всевозможные RFID-девайсы и гаджеты, которые можно притащить из Поднебесной. \n\nДружба с бесконтактными картами началась в 2008 году из-за необходимости проезжать по территории, которую незаконно загородили шлагбаумами. \n\nСейчас нестандартные манипуляции с бесконтактными картами превратились в любимое увлечение. \n\nПридерживаюсь образа жизни EasyLife — никуда не тороплюсь, нигде не опаздываю, люблю жить и выбираю только самое лучшее. ","ru_name":"Андрей Цуманов (любитель-экспериментатор)","id":28,"name":"Andrey Tsumanov","bio":"Graduated Faculty of journalism with honours. Loves all kinds of RFID devices and gadgets delivered from the Celestial Empire. Became friends with contactless in 2008 after a situation where he had to drive through an illegally barred territory. Now, unusual contactless manipulation are his favorite hobby. \n\nSticks with Easy Life: never hurries, never comes late, loves to live, and only chooses the best.","talk":30,"photo":"cumanov.jpg"},{"ru_bio":"Матеуш является большим фанатом повреждений памяти. Основные области его интересов — безопасность клиентского ПО, эксплуатация уязвимостей и техники борьбы с ними, а также блуждание по самым темным углам низкоуровневой начинки ядра, в первую очередь ядра Microsoft Windows. Сейчас работает разработчиком ИБ в Google. ","ru_name":"Mateusz 'j00ru' Jurczyk","id":29,"name":"Mateusz 'j00ru' Jurczyk","bio":"Mateusz is a big fan of memory corruption. His main areas of interest are client software security, vulnerability exploitation and mitigation techniques, and delving into the darkest corners of low-level kernel internals with a very strong emphasis on Microsoft Windows. He is currently working as an Information Security Engineer at Google.","talk":19,"photo":"j00ru.jpg"},{"ru_bio":"Nicolas Gregoire профессионально занимается взломом всяких штук более двенадцати лет. Когда-то он защитил некий старт-ап от весьма упорных русских хакеров (честное слово), потом провел 4 года в пен-тестах и некоторое время работал аудитором безопасности в одной из крупнейших французских PKI. \n\nВ начале 2011 он покинул эту должность и создал Agarri — маленькую компанию, где он ищет баги для клиентов или для развлечения. В основном он занимается исследованиям XML-технологий и питает необоснованную любовь к XSLT.","ru_name":"Nicolas Gregoire","id":30,"name":"Nicolas Gregoire","bio":"Nicolas Gregoire has been professionally hacking things for more than twelve years. After defending a start-up against some motivated russian hackers (true story!), he spent 4 years doing pentesting and then became an internal security auditor for one of largest French PKI. \n\nAt the beginning of 2011, he left this job to create Agarri, a small company where he finds bugs for customers or for fun. His main research area is XML technologies at large, with a unreasonable attraction for XSLT.","talk":41,"photo":"gregoire.jpg"},{"ru_bio":"Специалист группы анализа защищённости веб приложений компании Positive Technologies. Входит в команду исследовательского центра Positive Research.","ru_name":"Михаил Фирстов","id":31,"name":"Mikhail Fyrstov","bio":"Specialist of Positive Technologies web application security analysis group. Member of the Positive Research center team.","talk":34,"photo":"firstov.jpg"},{"ru_bio":"Александр Песляк, также известный как Solar Designer, профессионально занимается компьютерной и сетевой безопасностью с 1997 года. Александр является автором свободного программного обеспечения (в том числе популярной программы для аудита безопасности паролей John the Ripper), основателем проекта Openwall и компании Openwall, Inc., участником неофициальных и полуофициальных сообществ специалистов по компьютерной безопасности. Александр участвовал в международных конференциях с докладами о компьютерной безопасности и свободном программном обеспечении (HAL2001, NordU, FOSDEM, CanSecWest, PHDays, YaC), выступил техническим рецензентом книги о компьютерной безопасности Silence on the Wire Михала Залевского (Michal Zalewski) и написал для нее предисловие. ","ru_name":"Александр Песляк","id":32,"name":"Alexander Peslyak","bio":"Alexander Peslyak, better known as Solar Designer, has been professionally involved in computer and network security since 1997, and he has been professionally developing software long before that. Alexander is an Open Source software author & team leader at Openwall Project, computer security expert, Founder & CTO at Openwall, Inc., member of informal and semi-formal computer security communities. Alexander has presented on computer security and Open Source software topics at international conferences (HAL2001, NordU, FOSDEM, CanSecWest), served as the technical reviewer for a novel computer security book (Michal Zalewski's Silence on the Wire) and wrote the foreword for it. He is recognized in the security community primarily for the security tools (software) released to the public under liberal Open Source licenses, and for many contributions to other popular Open Source software (primarily Linux and related applications). ","talk":53,"photo":"solar.jpg"},{"ru_bio":"Окончил с красным дипломом КубГТУ в 2007 году по специальности «Программное обеспечение вычислительной техники и автоматизированных систем». Продолжил дальнейшее образование в аспирантуре на кафедре ВТ и АСУ по специальности системный аналитик. Преподавал практику по объектно-ориентированному программированию и системному программированию. Участвовал с группой студентов в Microsoft Imagine Cup с проектом музыкального инструмента для слепых детей. Занимался прямой и обратной разработкой в рабочее и не рабочее время. Работал системным администратором в ряде компаний. \n\nНа данный момент занят тестированием на проникновение и независимыми исследованиями на тему информационной безопасности. Обожает находить ошибки, отращивать бороду и писать программы на python. Иногда заглядывает на тренировки по тайскому боксу. ","ru_name":"Олег Купреев","id":33,"name":"Oleg Kupreev","bio":"Hardware infection is not a myth anymore. For instance, Rakshasa, which was shown at Defcon, is capable of infecting BIOS and PCI ROM (LAN, CDROM). The author of this paper decided to continue research towards infecting the software of the devices and checked the practical possibility to infect a modern 3G modem. \n\nThe 3G modems of the Big Three mobile network operators were used: MTS, BeeLine, Megafon. Software for cross-platform infection (Windows, Linux, MacOS X) of virtual CD-ROM images has been developed. ","talk":58,"photo":"kupreev.jpg"},{"ru_bio":"Babak Javadi — взломщик железа и заблудшая душа. Впервые он столкнулся с миром физической безопасности в третьем классе, получив взыскание всего лишь за то, что рассказал другому ученику, как разобрать ручку на двери классной комнаты. Он много лет вникал в электронику и взлом компьютерного железа и наконец нашел свое призвание в прекрасном и удивительном мире замков и сейфов с высокой степенью защищенности. Почти десять лет он был локомотивом клуба спортивного взлома замков и помог основать американское отделение The Open Organisation of Lockpickers (Открытое сообщество взломщиков), но в последнее время вновь вдохновился красотой бода и, горя жаждой мести, вернулся к взлому железа. Сейчас он — президент американского отделения The Open Organisation of Lockpickers и основатель The CORE Group, фирмы, которая занимается исследованиями и консультированием по безопасности. ","ru_name":"Babak Javadi","id":34,"name":"Babak Javadi","bio":"Babak Javadi is a hardware hacker with a wayward sprit. His first foray into the world of physical security was in the third grade, where he received detention for describing to another student in words alone how to disassemble the doorknob on the classroom door. After years of immersion in electronics and computer hardware hacking, he found his passion in the puzzling and mysterious world of high security locks and safes. After serving as a driving force within the locksport community for almost a decade and helping found the US division of The Open Organisation of Lockpickers, he has recently re-embraced the beauty of the baud and resumed hardware hacking with a vengeance. He currently serves as the President of the US group of The Open Organisation of Lockpickers (TOOOL) and is the founder of The CORE Group, a security research and consulting firm. ","talk":10,"photo":"javadi.jpg"},{"ru_bio":"Основатель и ведущий эксперт проекта Internal Security, технический директор компании SolidLab. Занимается исследованиями в области безопасности веб-приложений в лаборатории безопасности информационных систем на факультете ВМиК МГУ с 2004 года. Автор множества профильных публикаций. Является одним из основателей и действующим участником CTF-команды Bushwhackers. \n\nБлог: https://andrepetukhov.wordpress.com/","ru_name":"Андрей Петухов","id":35,"name":"Andrey Petukhov","bio":"Founder and leading expert of Internal Security; CTO of SolidLab. Researches web application security in the infosecurity laboratory of MSU Faculty of Computational Mathematics and Cybernetics since 2004. Published several papers on the topic. One of co-founders and an active participant of the CTF team called Bushwhackers.","talk":14,"photo":"petukhov.jpg"},{"ru_bio":"Аспирант лаборатории безопасности информационных систем факультета ВМиК МГУ, постоянный участник CTF-команды Bushwhackers, участник проекта OWASP Access Control Rules Tester, призер различных конкурсов по безопасности (Deutsche Post Security Cup, PHD 2012 WAF Bypass, Onsec WAF Challenge https://reward.onsec.ru/winners.html и др.)","ru_name":"Георгий Носеевич","id":36,"name":"Georgy Noseyevich","bio":"A PhD candidate in the infosecurity laboratory of MSU Faculty of Computational Mathematics and Cybernetics; a permanent member of the CTF team called Bushwhackers; participates in OWASP Access Control Rules Tester; rewarded in various infosec contests (Deutsche Post Security Cup, PHD 2012 WAF Bypass, Onsec WAF Challenge https://reward.onsec.ru/winners.html etc.)","talk":14,"photo":"noseevich.jpg"},{"ru_bio":"Институт закончил давно и не с первого раза. Работает менеджером по информационной безопасности в провинциальной компании. Практическая безопасность — хобби.","ru_name":"Игорь Гоц","id":37,"name":"Igor Gots","bio":"Graduated a long time ago and not on his first try. Works as an infosec executive in a small-town company. Practical security is his hobby.","talk":56,"photo":"gots.jpg"},{"ru_bio":"Окончил МГТУ им. Баумана по специальности Информационная безопасность (ИУ8). До 2002 работал программистом на C и Perl, с 2002 по 2012 в ТБинформ (ТНК-ВР), в настоящее время работает менеджером по информационной безопасности в компании РН-Информ. Практическая безопасность — и работа и хобби.","ru_name":"Сергей Солдатов","id":38,"name":"Sergey Soldatov","bio":"Graduated the Moscow State Technical University n.a. N.E. Bauman with a degree in information security. Until 2002, coded in C and Perl; from 2002 to 2012, worked for TB-inform (TNK-BP); currently, works as an information security executive in RN-inform. Practical security is his job as well as his hobby.","talk":56,"photo":"soldatov.jpg"},{"ru_bio":"Jean-Ian Boutin — исследователь вредоносного ПО в программе исследования безопасности ESET. На этой должности он отвечает за исследование актуальных тенденций вредоносного ПО и поиск эффективных методов противостояния этим угрозам. Жан-Йен — специалист по разработке, закончил Университет Конкордия в Монреале в 2009 году. Его интересы включают в себя исследование вредоносного ПО, ворующего информацию, а также угроз, направленных на конкретные регионы. Когда он не стучит по клавиатуре, то играет. ","ru_name":"Jean-Ian Boutin","id":39,"name":"Jean-Ian Boutin","bio":"Jean-Ian Boutin is a malware researcher in the Security Intelligence program at ESET. In his position, he is responsible for investigating trends in malware and finding effective techniques to counter these threats. Jean-Ian finished his Master degree in computer engineering at Concordia University in Montreal in 2009. His main interests include investigations on information stealer malware and threats targeting specific regions. When not on a keyboard, he enjoys playing.","talk":66,"photo":"boutin.jpg"},{"ru_bio":"Я — пентестер и занимаюсь этим любимым делом в компании Digital Security. Хакал много разнообразных систем, особенно много банк-клиентов. Трогал, наверное, все основные российские разработки.\n\nВо многих проанализированных системах я находил 0-day уязвимости. Например, в продуктах SAP, VMware, Citrix. А вот в Cisco — только переоткрывал старые. Эх! Зато для SAP я поучаствовал в закрытии большого XML-вектора.\n\nВообще, я люблю ломать крупные системы и Windows-style сети. Люблю различные логические баги и уязвимости-фичи.\n\nТак как кодить мне нравится, я являюсь одним из главных разработчиком набора для пентестов — ERPScan Pentesting tool.\n\nВ плане больших достижений могу отметить личное давнее знакомство с самим Алексеем Синцовым!\n\nСтараюсь сделать мир лучше, а потому с радостью делюсь знаниями и опытом посредством журнала «Хакер». В нем я почти третий год являюсь ведущим рубрики «EasyHack». Также являюсь одним из организаторов Defcon Russia.\n\nИнтересуюсь интересными вещами.","ru_name":"Алексей Тюрин","id":40,"name":"Alexey Tyurin","bio":"I am a pentester, and I do this great job for ERPScan. I have hacked a lot of various systems, especially remote banking systems. Probably touched all major Russian developments.\n\nIn many of the systems that I analyzed, I have found 0-day vulnerabilities. This happened, for instance, to SAP, VMware, and Citrix. But in Cisco, I have only re-opened some old bugs (alas). On top of that, I have participated in closing a major XML vector in SAP.\n\nIn all, I love hacking large systems and Windows style networks. I like various logical vulnerabilities and bugs that are features.\n\nI like coding, and that is why I am also one of the leading developers of ERPScan Pentesting tool.\n\nSpeaking of major achievements, I am personally acquainted with Alexey Sintsov himself!\n\nI try to make the world a better place, and that is why I am happy to share my knowledge and experience in the ][akep magazine. I have been the editor of the EasyHack column for almost three years now. I am also one of the organizers of Defcon Russia.\n\nMy interests include interesting things.","talk":28,"photo":"tyurin.jpg"},{"ru_bio":"Shay Chen — технический директор Hacktics, прогрессивного центра безопасности Ernst & Young. Также он — знаменитый блоггер и исследователь, соавтор Diviner и WAVSEP, автор множества исследований, посвященных безопасности, в том числе новым атаками на приложения, проектам с открытым исходным кодом, методикам тестирования, сравнению различных инструментов оценки безопасности, а также автор трех крупнейших исследований автоматизированных сканеров безопасности (в том числе сравнительного анализа 61 сканера веб-приложений в 2012 году). \n\nШэй много выступает и читает большое количество разнообразных курсов по безопасности. За его плечами больше 10 лет опыта в IT и ИБ, в том числе серьезный опыт в разработке приложений. ","ru_name":"Shay Chen","id":41,"name":"Shay Chen","bio":"Shay Chen is the CTO of Hacktics, an advanced security center of Ernst & Young. He is also a prominent blogger and researcher, the co-author of Diviner and WAVSEP, and is responsible for many security publications, including new application level attacks, open source projects, testing methodologies, various security tools comparison initiatives and three of the biggest researches performed in the field of automated security scanners (including the latest 2012 comparison of 61 web application scanners). \n\nShay is an experienced speaker, and regularly instructs a wide variety of security related courses. He has over ten years in information technology and security, including a strong background in software development. \n\nBefore moving into the information security field, he was involved in various software development projects in enterprise & mobile environments. ","talk":35,"photo":"chen.jpg"},{"ru_bio":"Эксперт-исследователь отдела аудита информационной безопасности компании «Перспективный мониторинг». \n\nСпециализируюсь на проведении тестов на проникновение.","ru_name":"Соболев Евгений","id":42,"name":"Eugeny Sobolev","bio":"Expert infosec researcher in Advanced Monitoring. I specialize in pen-testing. ","talk":59,"photo":"sobolev.jpg"},{"ru_bio":"Закончил ВМиК МГУ с красным дипломом, работает в Google над инструментами динамического анализа программ для Linux и Mac OS.","ru_name":"Александр Потапенко","id":43,"name":"Alexander Potapenko","bio":"Graduated from MSU Faculty of Computational Mathematics and Cybernetics with honours. Works for Google on dynamic software analysis tools for Linux and MacOS.","talk":65,"photo":"potapenko.jpg"},{"ru_bio":"Закончил МГТУ им Баумана, с 2002 года работал в сферах веб-приложений, биллинг, телеком, VoIP, социальные сети. В данный момент работает в Google над системами динамической верификации кода — AddressSanitizer (поиск ошибок памяти),ThreadSanitizer (поиск ошибок многопоточности); а также над поддержкой параллелизма и многоядерности в языке Go (параллельная сборка мусора, планировщик горутин, каналы, примитивы синхронизации и т.д.). Победитель Intel Threading Challenge 2010, одним из первых в мире был награжден титулом Intel BlackBelt. Имеет особый интерес в области многопоточности и многоядерности, автор дюжины инновационных алгоритмов синхронизации, разработал инструмент для их верификации.","ru_name":"Дмитрий Вьюков","id":44,"name":"Dmitry Vyukov","bio":"Graduated from MSTU n.a. N.E. Bauman. Since 2002, works on web applications, billing, telecommunications, VoIP, social networks. Currently, works for Google on dynamic code verification systems: AddressSanitizer (detector of memory errors) and ThreadSanitizer (detector of data races) as well as on parallelism and multikernel support in Go language (parallel garbage collection, goroutine planner, channels, sync primitives etc.) He won Intel Threading Challenge in 2010 and was among the first to obtain the Intel BlackBell title. He is especially interested in multithreading and multikernel, and has developed a dozen of innovational synchronization algorithms and a tool to verify them.","talk":65,"photo":"vyukov.jpg"},{"ru_bio":"Независимый исследователь в области информационной безопасности. \n\nРаботал исследователем в области информационной безопасности в таких компаниях, как Positive Technologies, Vupen Security, CISS. Любит писать эксплойты, особенно для ядра Windows NT. \n\nПобедитель конкурса PHDays Hack2Own в 2011 и 2012 годах. \n\nПытался хакнуть Google Chrome в Pwnium 2, но потерпел неудачу. Автор публикаций на тему уязвимостей в драйверах режима ядра и их эксплуатации. В настоящее время активно занимается исследованиями в области reverse engineering и автоматизации поиска уязвимостей.","ru_name":"Никита Тараканов","id":45,"name":"Nikita Tarakanov","bio":"An independent information security researcher. Worked as an IS researcher in Positive Technologies, Vupen Security, CISS. Likes writing exploits, especially for Windows NT Kernel. \n\nWon PHDays Hack2Own contest in 2011 and 2012. Tried to hack Google Chrome during Pwnium 2 but failed. Published a few papers about kernel mode drivers and their exploitation. Currently, he is actively engaged in reverse engineering research and vulnerability search automation. \n","talk":42,"photo":"tarakanov.jpg"},{"ru_bio":"Знаменит своими усами и проповедями во имя безопасности SAP. Конференцоголик. ","ru_name":"Александр Поляков","id":46,"name":"Alexander Polyakov","bio":"Famous for his moustache and SAP security evangelism. Conferenceholic.","talk":13,"photo":"polaykov.jpg"},{"ru_bio":"Руководитель лаборатории sieg.in. Исследователь безопасности приложений и систем. В прошлом инженер ЦНИИХМ, аудитор информационной безопасности Digital Security. ","ru_name":"Алексей Трошичев","id":47,"name":"Alexey Troshichev","bio":"Head of sleg.in lab. Researcher of application and system security. Formerly, engineer in Central Research and Development Institute of Chemistry and Mechanics, infosec auditor in ERPScan. ","talk":48,"photo":"troshichev.jpg"},{"ru_bio":"Начальник отдела перспективных разработок компании IXI. \n\nСпециалист по уязвимостям мобильных платформ. Последние три года в компании IXI отвечаю за исследование и анализ уязвимостей мобильных платформ на базе Android. Изучаю алгоритмы взлома и извлечения данных, отслеживаю все изменения в структуре ОС с целью оценки стойкости к различным сценариям атак. Нахожусь в постоянном поиске и губительных экспериментах по нестандартному использованию возможностей мобильных гаджетов. Разработчик ряда защищенных мобильных решений и просто коллекционер мобильных секретов. Направление моей работы — обеспечение защиты конфиденциальности для пользователей мобильных устройств на базе ОС Android. ","ru_name":"Сергей Карасиков","id":48,"name":"Sergey Karasikov","bio":"Head of progressive development department in IXI. \n\nI specialize in mobile vulnerabilities. For the last three years spent in IXI, I have been responsible for research and analysis of vulnerabilities of Android-based mobiles platforms. I study the algorithms of hacking and data derivation, I keep track of all changes in OS structure to evaluate its hardness against various attack scenarios. I constantly search for possibilities to use mobile gadgets in an uncommon way, and I conduct suicidal experiments. I am the developer of a range of secure mobile solutions and simply a collector of mobile secrets. My work is directed at ensuring the protection of confidentiality for Android users. ","talk":50,"photo":"karasikov.jpg"},{"ru_bio":"Директор по исследованиям компании «Цифровое оружие и защита» (Esage Lab), со-основатель и спонсор Хакспейса Нейрон.","ru_name":"Алиса Шевченко","id":49,"name":"Alisa Shevchenko","bio":"Head of research in Esage Lab; co-founder and sponsor of Neuron Hackspace. ","talk":51,"photo":"shevchenko.jpg"},{"ru_bio":"Очередной секьюрити ресечер. Человек, чью фамилию каждый раз пишут с ошибками. Так же как и все, небезразличен к информационно безопасности. Так же как и все, где-то учился. Так же как и все, где-то работал. Так же как и все, находил баги в приложениях и ресурсах, которые все и так знают. \n\nСреди огромного числа достижения Дмитрия непременно стоит отметить способность чихать с открытыми глазами и одну партию в бильярд, выигранную у Алексея Синцова. \n\nПереломным моментом в своей жизни считает работу в компании Digital Security. На конференции ездил. Доклады читал. Благодарности от вендоров получал. На момент написания биографии слушает трек Die Antwoord – Never Le Nkemise 2. Свободен)","ru_name":"Дмитрий 'chipik' Частухин","id":50,"name":"Dmitry 'Chipik' Chastukhin","bio":"Another security researcher. Sports a surname that nobody can spell correctly. Like everyone else, has a thing for infosec. Like everyone else, studied somewhere. Like everyone else, worked somewhere. Like everyone else, found vulnerabilities in certain well-known applications and resources. \n\nAmong the multiple achievements of Dmitry, his astounding capability of sneezing with open eyes must be noted, as well as a game of billiards that he has once won from Alexey Sintsov. \n\nThinks of his work for ERPScan as a watershed moment. Been to conferences. Presented papers. Got acknowledgements from vendors. Was listening to Never Le Nkemise 2 by Die Antwoord while writing the bio. Single) ","talk":52,"photo":"chastihin-cherbov.jpg"},{"ru_bio":"Выпускник хакфедры ИБКС Петербургского Политеха. Уайтхэт, исследователь, пентестер, аналитик в Digital Security. «Еще один чувак» © Антон toxo4ka Карпов","ru_name":"Глеб Чербов","id":51,"name":"Gleb Cherbov","bio":"Graduated from the Department of Information Security, Faculty of Engineering Cybernetics, Saint-Petersburg State Technical University. Whitehat, researcher, pentester, and analyst in ERPScan. “Another dude” © Anton 'toxo4ka' Karpov. \n\nParticipates and parties in the same gang with Alexey Sintsov, Alexey Tyurin, Alexander 'sh2kerr' Polyakov, Dmitry 'chipik' Chastukhin, Gleb Cherbov, Alexander Minozhenko, and other tech savvies of ERPScan.","talk":52,"photo":"chastihin-cherbov.jpg"},{"ru_bio":"Специализируется на безопасности SAP, в частности на Kernel, BASIS и ABAP, а также на безопасности мобильных приложений, в частности мобильного банкинга. Имеет официальные благодарности от SAP и Oracle за уязвимости, обнаруженные в их продуктах. Занимается методами обратной инженерии, верификации и анализа программного обеспечения (SMT, DBI, IL), исследованием уязвимостей и разработкой эксплойтов, а также ПО для статического и динамического анализа кода на языке Python. Редактор рубрик «Security soft» и «X-Tools» для журнала ][akep. Один из организаторов Defcon Russia. \n\nСостоит и отрывается в банде с Алексеем Синцовым, Алексеем Тюриным, Александром 'sh2kerr' Поляковым, Дмитрием 'chipik' Частухиным, Глебом Чербовым, Александром Миноженко и другими технически подкованными спецами DSecRG. ","ru_name":"Дмитрий 'D1g1' Евдокимов","id":52,"name":"Dmitry 'D1g1' Evdokimov","bio":"Dmitry Evdokimov works for ERPScan research center in Russia. He focuses on SAP security, particularly on Kernel and Mobile security (iOS, Android, WP). He has official acknowledgements from SAP and Oracle for the vulnerabilities he found. His interests cover reverse engineering, software verification/program analysis (SMT, DBI, IL), vulnerability research and development of exploits, software for static and dynamic code analysis written in Python. ”Security soft” and \"X-Tools\" section editor in Russian hacker magazine “XAKEP”. One of the Defcon Russia (DCG #7812) organizers. ","talk":55,"photo":"evdokimov.jpg"},{"ru_bio":"Ведущий инженер по эксплуатации в Highload.","ru_name":"Александр Азимов","id":53,"name":"Alexander Azimov","bio":null,"talk":25,"photo":"azimov.jpg"},{"ru_bio":"Глава отдела разработки в Highload.","ru_name":"Артем Гавриченков","id":54,"name":"Artyom Gavrichenkov","bio":null,"talk":25,"photo":"gavrichenkov.jpg"},{"ru_bio":"Генеральный директор Highload.","ru_name":"Александр Лямин","id":55,"name":"Alexander Lyamin","bio":null,"talk":25,"photo":"lyamin.jpg"}]
