[{"ru_description":"","ru_name":"Регистрация","ru_speakers":"","day":1,"begintime":"8:00","track":1,"id":1,"name":"Registration","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Открытие. Вступительное слово организаторов","ru_speakers":null,"day":1,"begintime":"9:30","track":1,"id":2,"name":"Open conference","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Вступительное слово спонсоров","ru_speakers":null,"day":1,"begintime":"9:50","track":1,"id":3,"name":"Sponsors","description":null,"speakers":null,"type":0},{"ru_description":"Наученный горьким опытом хакеров, арестованных в последнее время, и вникнув в методы надзора, шпионажа и контрразведки, я создал этот доклад. Он научит вас применять принципы практической боевой безопасности (practical operational security — OPSEC), чтобы вас не обнаружили и не арестовали правоохранительные органы. Целевая аудитория этого доклада — хактивисты, чья миссия требует от них оставаться анонимными в Сети под пристальным надзором своих противников, не испытывающих недостатка в ресурсах. Я начну с описания целей OPSEC, а затем перейду к техникам, методам и технологиям, чтобы слушатели могли разработать для себя надежные защитные меры и применить их на практике. Эффективная OPSEC требует сочетания мощных технологических решений и безукоризненной осторожности, чтобы «конфиденциальная информация» раскрывалась как можно реже. В этом докладе перечислены принципы OPSEC и методы отрицания конфиденциальной информации в полиции. Хактивисты получат необходимые инструменты для того, чтобы успешно проводить боевые действия в Сети и оставаться на свободе.","ru_name":"Ключевой доклад: OPSEC: Тюрьма — это для wuftpd","ru_speakers":"The Grugq","day":1,"begintime":"10:00","track":0,"id":4,"name":"Keynote. \"OPSEC: Because Jail is for wuftpd\"","description":"Drawing on lessons gleaned from recent hacker indictments, research on surveillance, espionage and counter-intelligence, this talk focuses on practical operational security (OPSEC) measures to avoid detection and prevent arrest by Law Enforcement Officials. The target audience for this talk are hacktivists whose primary mission requires strong online anonymity in the face of intense scrutiny by well-funded antagonists. Starting with a review of OPSEC goals and moving onto methodologies, techniques and technologies, this presentation will enable the target audience to devise and implement robust OPSEC measures. Effective OPSEC requires combining strong technology solutions with disciplined cautious actions to minimize the exposure of “protected information”. The talk will enumerate OPSEC principles and techniques to deny protected information to LEO, and equip hacktivists with the tools necessary to successfully conduct online operations while avoiding capture.","speakers":"The Grugq","type":0},{"ru_description":"","ru_name":"Кофе-брейк","ru_speakers":"","day":1,"begintime":"10:45","track":0,"id":5,"name":"Coffe break","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Совершенно секретно","ru_speakers":null,"day":1,"begintime":"11:00","track":1,"id":6,"name":"Secret talk","description":null,"speakers":"Alberto Garcia","type":0},{"ru_description":"Технологии, связанные с авиацией, находятся на пике технологического развития и продвижения, то есть примерно там же, где были сети сотовой связи и смартфоны 5–10 лет назад. \n\nПрактика показывает, что это технологическое развитие открывает новые возможности как для нововведений и более продуктивной работы, так и для эксплуатации уязвимостей. \n\nВ нашей презентации и отчете мы рассмотрим (не)безопасность ADS-B с практической точки зрения. Мы расскажем о том, что и как злоумышленники могут сделать с генерируемым и внедряемым авиационным траффиком и насколько такие атаки вероятны. Мы продемонстрируем вам новые векторы атак на системы управления воздушным движением. ","ru_name":"Особенности безопасности ADS-B и других воздушных технологий","ru_speakers":"Андрей Костин","day":1,"begintime":"11:50","track":1,"id":7,"name":"On security aspects of ADSB and other \"flying\" technology","description":"Air-related technologies are on the verge of technological upgrade and advance in approximately the same manner the mobile communication networks and smartphones were 5-10 years. \n\nAs noticed in practice, these technological advances open opportunities for performance and innovation, but at the same time open great opportunity for security exploitation. \n\nIn this talk and whitepaper, we will approach the ADS-B (in)security from the practical angle, presenting the feasibility and techniques of how potential attackers could play with generated/injected airtraffic and as such potentially opening new attack surfaces onto AirTrafficControl systems.","speakers":"Andrei Costin","type":0},{"ru_description":null,"ru_name":"Перерыв","ru_speakers":null,"day":1,"begintime":"12:35","track":1,"id":8,"name":"Break","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Обед","ru_speakers":null,"day":1,"begintime":"13:00","track":0,"id":9,"name":"Lunch","description":null,"speakers":null,"type":0},{"ru_description":"Системы сигнализации разрабатывались до распространения беспроводных технологий. Они общаются с проприетарным протоколом по двужильной шине данных. Эта шина разрабатывалась для взаимодействия панелей сигнализации с клавиатурой и расширителем проводных зон. Однако сейчас ее функционал также распространился на коммуникацию с беспроводными сенсорами. К сожалению, эти системы мало исследуются, а информация о том, как с ними работать, скудна и часто неверна. В этом докладе я продемонстрирую множество классических уязвимостей в сигнализационных системах и покажу множество новых методов снижения эффективности этих систем. Особое внимание я уделю слабостям и новым эксплойтам RF-подсистемы коммерческой сигнализационной системы, которая сегодня наиболее популярна на рынке. ","ru_name":"Сопротивление бесполезно: взлом беспроводных сигнализационных систем","ru_speakers":"Babak Javadi","day":1,"begintime":"14:30","track":1,"id":10,"name":"Armed Failure — Hacking Wireless Alarm Systems","description":"Alarm systems and panels were designed before the prevalence of wireless technology and communicate with a proprietary protocol over a two-wire data bus. This bus was designed for use between alarm panels, keypads and zone expanders. However this has now been extended to allow the system to communicate with wireless sensors. Unfortunately, little research has been performed regarding these systems, and operational information about them is scarce and often incorrect. This presentation will demonstrate several classic vulnerabilities of alarm installations and then present several new techniques for reducing the effectiveness of the alarm system. In particular, this talk will focus on weaknesses and new exploits of the RF subsystem of the most popular commercial alarm system on the market today. ","speakers":"Babak Javadi","type":0},{"ru_description":"Вы никогда не задумывались о надежности и безопасности высокотехнологичных платежных средств, обитающих в Вашем кошельке и карманах? Cамое время узнать об этом — в докладе рассматриваются аспекты безопасности современных электронных платежных технологий из «реального мира»: микропроцессорных банковских карт стандарта EMV и платежных решений на основе устройств с поддержкой NFC (Near Field Communication). Будут изложены принципы работы данных технологий, рассмотрены как известные ранее, так и новые вектора атак и меры противодействия им, прогнозы и аналитика. ","ru_name":"Безопасность современных платежных технологий: EMV, NFC, etc.?","ru_speakers":"Никита Абдуллин","day":1,"begintime":"15:20","track":1,"id":11,"name":"Modern payments security: EMV, NFC, etc.?”","description":"Have you ever thought about security & reliability of the high-tech payment stuff that inhabits your wallet and pockets? Then be prepared -- the talk will cover the security aspects of modern payment technologies from the real world: EMV-enabled credit cards and NFC-based payment solutions. Among the topics presented will be the principles of operation for EMV and NFC, attack vectors both well-known and new, countermeasures, perspectives and analytics. ","speakers":"Nikita Abdullin","type":0},{"ru_description":null,"ru_name":"Кофе-брейк","ru_speakers":null,"day":1,"begintime":"16:05","track":0,"id":12,"name":"Coffe break","description":null,"speakers":null,"type":0},{"ru_description":"Итак, у вас есть проект по пен-тесту внутренней инфраструктуры крупного предприятия. И что теперь? Как обычно: сканирование, эксплуатация, эскалация? Или что-то поинтереснее? Иногда наилучшая стратегия это слушать что происходит в сети и сфокусироваться на ключевых точках отказа, например, на Enterprise Service Bus, а также на нетипичных атаках. ","ru_name":"Как бы я атаковал корпоративную сеть крупной корпорации","ru_speakers":"Александр Поляков","day":1,"begintime":"16:30","track":1,"id":13,"name":"How i will break your Enterprise","description":"So, you have a project to pen-test the internals of a large enterprise. Now what? The same way again, like scan, exploit, escalate? Or something more interesting? Sometimes it’s better to listen to what has been happening in the network and concentrate on key points of failure, for example, Enterprise Service Bus, and on uncommon attacks. ","speakers":"Alexander Polyakov","type":0},{"ru_description":"Одним из основных функциональных компонентов enterprise-приложений и Интернет-порталов является подсистема проверки подлинности и разграничения доступа (AuthC/Z). В докладе рассматривается распространенная система управления доступом ForgeRock OpenAM с точки зрения защищенности к атакам со стороны внешнего злоумышленника. Будут продемонстрированы сценарии полной компрометации Enterprise-приложений через комплексные атаки, объединяющие вектора LFI и SSRF.","ru_name":"Ни замков, ни засовов: взлом инфраструктуры OpenAM","ru_speakers":"Андрей Петухов, Георгий Носеевич","day":1,"begintime":"17:20","track":1,"id":14,"name":"No locked doors, no windows barred: hacking OpenAM infrastructure","description":"One of the main functional components of enterprise applications and Internet portals is an authentication and access control system (AuthC/Z). In this presentation, we will describe a popular access control system called ForgeRock OpenAM from the external security point of view. I will show the scenarios of full enterprise application compromise through complex attacks which employ both LFI and SSRF. ","speakers":"Andrey Petukhov, Georgy Noseyevich","type":0},{"ru_description":null,"ru_name":"Кофе-брейк","ru_speakers":null,"day":1,"begintime":"18:05","track":0,"id":15,"name":"Coffe break","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Дискуссионная панель: Исследователи безопасности против Разработчиков","ru_speakers":null,"day":1,"begintime":"18:20","track":0,"id":16,"name":"Panel Discussion: \"Security Researchers vs. Developers\"","description":null,"speakers":null,"type":0},{"ru_description":"В настоящее время наиболее широкую известность получили руткиты, которые используются во вредоносных программах массового распространения. Однако они также применяются и при целевых атаках, из-за чего руткит-технологии можно разделить на две большие группы. Главное отличие руткитов, применяемых при целевых атаках, от их более массовых собратьев заключается в том, что они должны не только препятствовать обнаружению факта компрометации системы в режиме её повседневной эксплуатации (оставаться невидимыми для пользователя и антивирусных программ), но и обладать качествами, которые максимально затрудняли бы детектирование руткита при его целенаправленном поиске высококвалифицированными специалистами по криминалистической экспертизе. \n\nВ данном докладе будут подробно рассмотрены следующие вопросы:\nОсновные подходы к выявлению вредоносного кода при исследовании скомпрометированной системы.\nПрактические аспекты реализации руткитов для применения в целевых атаках.\nДемонстрация концептуальных руткитов, использующих интересные технические приёмы для сокрытия и исполнения кода в ring0.\nСпособы детектирования рассмотренных в ходе доклада концептов.\nP.S. Информация, которая будет представлена публике, не является очередным никому не нужным исследованием вида «новый способ перехвата какой-то фигни в ядре ОС». Главная цель докладчика заключается в демонстрации примеров и результатов комплексного подхода к разработке сложнодетектируемого вредоносного кода. ","ru_name":"Прикладная анти-форензика: руткиты, уязвимости ядра и все-все-все","ru_speakers":"Олексюк Дмитрий (aka Cr4sh)","day":1,"begintime":"11:00","track":2,"id":18,"name":"Applied anti-forensics: rootkits, kernel vulnerabilities and then some","description":"Currently, the most well-known type of rootkits is those used in mass distribution malware. But they are also used in targeted attacks, so rootkit technologies can be divided into two large groups. The main difference between the rootkits used in targeted attacks and their mass scale counterparts is that the former should, on top of preventing the detection of system compromise on a daily basis (that is, staying invisible for users and antiviral software), be able to obstruct the detection of the rootkit to the maximum possible extent when it is specifically searched for by high-qualified forensics professionals. \n\nIn the presentation, the following questions are discussed in detail:\nMain approaches to malware detection in the research of a compromised system.\nPractical aspects of rootkit development for targeted attacks.\nDemonstration of conceptual rootkits which use interesting techniques to conceal and execute code in ring0.\nWays to detect the concepts covered in the presentation.\n\nP.S. The information which will be presented is not yet another good-for-nothing research of the “new ways to intercept some useless crap in OS kernel”. The speaker’s goal is to demonstrate examples and results of a complex approach to the development of hard-detectable malware.","speakers":"Oleksiuk Dmytro (aka Cr4sh)","type":0},{"ru_description":"Уязвимости ядра Windows приближаются к почетному второму месту в списке самых актуальных поводов для беспокойства посредственных разработчиков ПО, сразу после проблем безопасности клиентской стороны, так как они позволяют с помощью удаленных эксплойтов обходить «песочницы» в популярных браузерах и редакторах документов. Поскольку каждый месяц находят и исправляют все больше подобных ошибок безопасности, а Microsoft вкладывает все больше и больше усилий в защиту ядра, мы считаем, что не менее важно исследовать и обсудить возможность полностью избавиться от некоторых классов проблем. В данной презентации мы обратим особое внимание на отдельные интересные недочеты в ядре, появившиеся в результате ошибок в подсчете ссылок, недавно исправленной Microsoft. Мы объясним, как именно они влияют на безопасность системы, и предложим несколько идей по формированию более общего подхода к этим ошибкам. ","ru_name":"Уязвимости подсчета ссылок в ядре Windows: практический анализ","ru_speakers":"Mateusz 'j00ru' Jurczyk","day":1,"begintime":"11:50","track":2,"id":19,"name":"Windows Kernel Reference Count Vulnerabilities - Case Study\"","description":"Windows kernel vulnerabilities are quickly becoming the second most significant concern of low-level software specialists after client-side security issues, allowing remote exploits to subvert the widely deployed sandboxing technologies found in popular web browsers or document readers. As a growing number of such security flaws is being found and fixed every month with Microsoft investing more and more effort into hardening the kernel, we believe it is equally important to understand and discuss how certain classes of bugs could be eliminated entirely. In this presentation, we will highlight several interesting kernel-mode flaws caused by invalid reference counting recently patched by Microsoft, cover their actual impact on the system security and propose some ideas of how the bugs could have been addressed in a more generic way.","speakers":"Mateusz 'j00ru' Jurczyk","type":0},{"ru_description":null,"ru_name":"Перерыв","ru_speakers":null,"day":1,"begintime":"12:35","track":2,"id":20,"name":"Break","description":null,"speakers":"","type":0},{"ru_description":"Набор эксплойтов — это набор вредоносных программ, которые, как правило, используются для выполнения автоматизированных driveby-атак с целью дальнейшего распространения вирусов. Такой набор можно купить на черном рынке (в основном у русских киберпреступников) по цене от нескольких сотен до пары тысяч долларов и даже больше. В последнее время обычной практикой также стала аренда эксплойт-паков, расположенных на определенном сервере. Таким образом, сформировался конкурентный рынок с множеством игроков, в том числе с множеством различных авторов. Несколько лет назад появился MPack – один из первых таких инструментов. Вскоре за ним последовали ICE-Pack, Fire-Pack и многие другие. Среди хорошо известных современных эксплойт-паков – например, Eleonore, YES Exploit Pack и Crimepack. \n\nЧтобы защитить свои наборы эксплойтов, киберпреступники используют решения для перевода исходного кода в байткод (виртуализованный и обфусцированный). Затем он кодируется и передается загрузчику, который распространяет его через PHP-страницу. Проданные наборы эксплойтов также защищаются с помощью строгой политики лицензирования, запрещающей копирование и распространение. \n\nВ своем докладе я расскажу о том, как система защиты от копирования ionCube используется для защиты наборов эксплойтов. Еще я покажу, как взломать эту защиту и восстановить исходный код эксплойта, а также как выяснить, какие IP-адреса привязаны к определенной лицензии на набор эксплойтов. \n\nПлан:\nПонимание защиты от копирования (архитектура виртуальной машины)\nВнутренности ВМ\nПараметры ВМ\nЧто у ВМ под капотом (декодирование и деобфускация)\nВзлом алгоритма шифрования лицензии\nПолучение информации о лицензии из заголовка ВМ\nВыводы","ru_name":"Как украсть у вора: ломаем IonCube VM и реверсим сборки эксплойтов","ru_speakers":"Mohamed Saher","day":1,"begintime":"14:30","track":2,"id":21,"name":"Stealing from Thieves: Breaking IonCube VM to Reverse Exploit Kits","description":"Exploit kits are packs containing malicious programs that are mainly used to carry out automated ‘driveby’ attacks in order to spread malware. These kits are sold on the black market (mostly by Russian cyber mafia), where prices typically range from several hundred to over a couple thousand dollars. It is also becoming quite common to rent hosted exploit kits. Because of this, a competitive market has emerged with numerous players, including many different authors. Appearing several years ago, MPack was one of the first examples of this type of ‘tool’. This was followed shortly after by ICE-Pack, Fire-Pack and a variety of others. Today’s well-known exploit kits are, for example, Eleonore, the YES Exploit Pack, and Crimepack. \n\nIn order to protect their exploit kits, cyber criminals are using solutions that convert source code to byte code (virtualized and obfuscated), which is then encoded and passed to a loader that can then be delivered via a PHP web page. Purchased exploit kits are further protected through the use of strict licensing that restricts copying and redistribution. \n\nIn this talk, I will discuss how ionCube copy protection is used to protect exploit kits. I will also demonstrate how to break that protection in order to recover the exploit kit source code, as well as identify which IP Addresses are tied to a particular exploit kit license. \n\nOutline\nUnderstanding Copy Protection (VM Architecture)\nVM Internals\nVM Parameters\nVM Under the Hood (Decoding and Deobfuscation)\nBreaking the Encryption Algorithm for Licensing\nExtracting License Information from VM header\nConclusion","speakers":"Mohamed Saher","type":0},{"ru_description":"В этом докладе вы не найдете упоминания о разоблачении правительственных структур причастных к разработке Win32/Flamer, а так же различных конспирологических теорий на тему кибероружия. В докладе будут рассмотрены подходы к обратному анализу вредоносного программного обеспечения, имеющего объектно-ориетнитрованную архитектуру, на примере одной из самых сложных угроз за все время существования антивирусной индустрии. На примере Win32/Flamer будет представлена методика, разработанная авторами в процессе анализа таких сложных угроз, как Stuxnet, Duqu и Festi. В ходе выступления будут представлены проблемы, с которыми приходилось сталкиваться в процессе анализа данных угроз и пути их решения с использованием инструментария от Hex-Rays. Также авторы доклада представят результаты своих исследований, посвященных реконструкции объектно-ориентированной платформы на базе которой был разработан Win32/Flamer, и продемонстрируют его родство со Stuxnet/Duqu/Gauss на уровне кода и архитектуры. ","ru_name":"Обратный анализ и реконструкция объектно-ориентированной архитектуры Win32/Flamer","ru_speakers":"Александр Матросов, Евгений Родионов","day":1,"begintime":"15:20","track":2,"id":22,"name":"Win32/Flamer: Reverse Engineering and Framework Reconstruction","description":"In this talk one wouldn’t see any speculations on state-sponsored cyber-espionage and сonspirology theories on cyber weapon development. In the presentation authors will concentrate on different approaches to analysis of the malware based on object oriented architecture with respect to one of the most complex threat ever known while AV industry exists: Win32/Flamer. The authors will present methods of analysis of the malware developed in the course of research of such threats as Stuxnet, Duqu and Festi. The talk will shed light on the problems the researchers face during investigation of complex threats and the ways to deal with them using tools by Hex-Rays. The authors will also present the result of research on reconstructing framework which was used to construct Win32/Flamer and will show its similarity with Stuxnet/Duqu/Gauss with respect to code and architecture. ","speakers":"Aleksandr Matrosov, Eugene Rodionov","type":0},{"ru_description":"На сегодняшний момент по классификации Dr.Web насчитывается порядка 20 разновидностей вредоносных программ для операционной системы Mac OS X. В докладе представлен сравнительный анализ основных представителей. При этом в качестве критериев сравнения рассматриваются различные аспекты, начиная от предназначения вредоносной программы и заканчивая отличительными особенностями каждого семейства угроз. ","ru_name":"Обзор вредоносных программ для Mac OS X","ru_speakers":"Иван Сорокин","day":1,"begintime":"16:30","track":2,"id":23,"name":"Mac OS X malware overview","description":"In this talk one wouldn’t see any speculations on state-sponsored cyber-espionage and сonspirology theories on cyber weapon development. In the presentation authors will concentrate on different approaches to analysis of the malware based on object oriented architecture with respect to one of the most complex threat ever known while AV industry exists: Win32/Flamer. The authors will present methods of analysis of the malware developed in the course of research of such threats as Stuxnet, Duqu and Festi. The talk will shed light on the problems the researchers face during investigation of complex threats and the ways to deal with them using tools by Hex-Rays. The authors will also present the result of research on reconstructing framework which was used to construct Win32/Flamer and will show its similarity with Stuxnet/Duqu/Gauss with respect to code and architecture. ","speakers":"Ivan Sorokin","type":0},{"ru_description":"Обогреть жилище — важная задача, но к ней надо подходить с умом. Мы покажем, как мы находим уязвимости, создаем кейсы, используем грамматику, собираем и отслеживаем сбои, запускаем, наблюдаем, останавливаем и обновляем браузеры, минимизируем повторы багов, прибегаем к помощи Redis, координируем кластеры и планируем ресурсы.","ru_name":"О фаззинге подробно и со вкусом","ru_speakers":"Atte Kettunen, Miaubiz","day":1,"begintime":"17:20","track":2,"id":24,"name":"Fuzzing at scale and in style","description":"Heating your house is important, but it helps being smart about it. We will show you how we find vulns, generate cases, use grammars, bin and track crashes, start, stare at, stop and update browsers, minimize repros, use redis, coordinate clusters and target our resources. ","speakers":"Atte Kettunen, Miaubiz","type":0},{"ru_description":"О DDoS в трех частях:\n\n«Game of BGP» (Александр Азимов) \n\nИзвестно, что нестабильная междоменная маршрутизация может очень сильно повлиять на доступность префиксов. Есть две причины для нестабильности сети на уровне автономных систем: ошибки конфигурации маршрутизатора и петли маршрутизации, возникающие в процессе конвергенции BGP. В своем докладе я постараюсь осветить наиболее частые ошибки конфигурации маршрутизаторов, а также основные тенденции различных событий маршрутизации. \n\n\n«Как не надо писать приложения, основанные на протоколе TCP: взгляд оператора сети» (Артем Гавриченков) \n\nБолее трех лет разработчики Qrator собирали и анализировали частые ошибки программирования сетевых приложений, включая вебсайты и протоколы собственной разработки на основе TCP. Этот доклад – о том, как избежать популярных ошибок при разработке собственного протокола, и о том, как настроить сервер приложений, на котором будет расположено масштабируемое сетевое приложение. \n\n\n«DDoS-атаки 2012: искусство выживания» (Александр Лямин) \n\nВсе мы знаем, что DDoS подразумевает ботнет, а смысл существования ботнета — помогать проводить успешные DDoS-атаки. По крайней мере, так было раньше. Однако защитные меры развиваются, и эксплуатировать L7 простым запросом \"GET /\" уже не получается. Чтобы полностью загрузить браузер и при этом имитировать человеческое поведение, необходим новый уровень хитрости и математических расчетов. Кроме того, эффективность ботнетов резко упала.\nТребования к участникам workshop:\n3 часа времени\nИ вопросы, которые вас волнуют","ru_name":"DDoS","ru_speakers":"Александр Азимов, Артем Гавриченков, Александр Лямин","day":1,"begintime":"11:00","track":3,"id":25,"name":"DDOS Workshop (part 1&2)\n1. \"Game of BGP\"\n 2. \"How should TCP-based\napplications NOT be developed\"","description":"About DDoS in three chapters:\n\n“Game of BGP” by Alexander Azimov \n\nThere is an obvious fact that instability at inter-domain routing level could have great influence on prefix availability. There are two main reasons for network instability at the level of Autonomous Systems: router misconfigurations and routing loops which occur during BGP convergence process. During this talk, I’ll try to cover common errors in router configuration and show main trends of different routing events. \n\n\n“Network Operator's View: HOW[NOT]TO Write TCP-based Network Applications” by Artem Gavrichenkov \n\nFor over 3 years developers of Qrator collected and analyzed common programming errors in network applications, including Web sites and custom TCP-based protocols. The speech is focused on how to avoid frequent mistakes when designing your own protocol and how to set up an application server hosting a scalable network application. \n\n\n“Beyond the botnet” by Alexander Lyamin. \n\nWe all know that “DDoS” == “botnet” and botnets are the means to carry out successful DDoS attack. At least it used to be. But as defensive measures progress and exploiting L7 with simple “GET /”is not efficient anymore, and full browser stack with imitation of human behavior takes another level of sophistication and math. It’s also leading to dramatic drop in botnet efficiency. Is it GAME OVER for DDoS?\nRequirements for participants to workshop:\n3 hours\nAny questions that worry yous","speakers":" Artem Gavrichenkov, Alexander Azimov","type":0},{"ru_description":"О DDoS в трех частях:\n\n«Game of BGP» (Александр Азимов) \n\nИзвестно, что нестабильная междоменная маршрутизация может очень сильно повлиять на доступность префиксов. Есть две причины для нестабильности сети на уровне автономных систем: ошибки конфигурации маршрутизатора и петли маршрутизации, возникающие в процессе конвергенции BGP. В своем докладе я постараюсь осветить наиболее частые ошибки конфигурации маршрутизаторов, а также основные тенденции различных событий маршрутизации. \n\n\n«Как не надо писать приложения, основанные на протоколе TCP: взгляд оператора сети» (Артем Гавриченков) \n\nБолее трех лет разработчики Qrator собирали и анализировали частые ошибки программирования сетевых приложений, включая вебсайты и протоколы собственной разработки на основе TCP. Этот доклад – о том, как избежать популярных ошибок при разработке собственного протокола, и о том, как настроить сервер приложений, на котором будет расположено масштабируемое сетевое приложение. \n\n\n«DDoS-атаки 2012: искусство выживания» (Александр Лямин) \n\nВсе мы знаем, что DDoS подразумевает ботнет, а смысл существования ботнета — помогать проводить успешные DDoS-атаки. По крайней мере, так было раньше. Однако защитные меры развиваются, и эксплуатировать L7 простым запросом \"GET /\" уже не получается. Чтобы полностью загрузить браузер и при этом имитировать человеческое поведение, необходим новый уровень хитрости и математических расчетов. Кроме того, эффективность ботнетов резко упала.\nТребования к участникам workshop:\n3 часа времени\nИ вопросы, которые вас волнуют","ru_name":"DDoS","ru_speakers":"Александр Азимов, Артем Гавриченков, Александр Лямин","day":1,"begintime":"14:30","track":3,"id":26,"name":"DDOS Workshop (part 3)\n3. \"DDOS attacks in 2012: how to survive\"","description":"About DDoS in three chapters:\n\n“Game of BGP” by Alexander Azimov \n\nThere is an obvious fact that instability at inter-domain routing level could have great influence on prefix availability. There are two main reasons for network instability at the level of Autonomous Systems: router misconfigurations and routing loops which occur during BGP convergence process. During this talk, I’ll try to cover common errors in router configuration and show main trends of different routing events. \n\n\n“Network Operator's View: HOW[NOT]TO Write TCP-based Network Applications” by Artem Gavrichenkov \n\nFor over 3 years developers of Qrator collected and analyzed common programming errors in network applications, including Web sites and custom TCP-based protocols. The speech is focused on how to avoid frequent mistakes when designing your own protocol and how to set up an application server hosting a scalable network application. \n\n\n“Beyond the botnet” by Alexander Lyamin. \n\nWe all know that “DDoS” == “botnet” and botnets are the means to carry out successful DDoS attack. At least it used to be. But as defensive measures progress and exploiting L7 with simple “GET /”is not efficient anymore, and full browser stack with imitation of human behavior takes another level of sophistication and math. It’s also leading to dramatic drop in botnet efficiency. Is it GAME OVER for DDoS?\nRequirements for participants to workshop:\n3 hours\nAny questions that worry yous","speakers":"Alexander Lyamin","type":0},{"ru_description":"XML (Extensible Markup Language) — хотя в своей основе это всего лишь язык разметки, он стал основой для различных форматов хранения и передачи данных. И теперь, XML, в широком смысле слова, и технологии, на нём завязанные, глубоко пронизывают большинство информационных систем, от маленький до сверхбольших. А потому знание и понимание атак связанных с XML из-за своей универсальности будут полезны любому пентестеру.\n\nНа workshop’e будет:\nОбщее описание XML и процесса обработки XML документов\nОписание технологий связанных с XML (WSDL, SOAP, DTD, XPath, XSLT, XML Signature, XML Encryption и т.д.) и сфер их применения\nБольшинство современных атак, завязанных на XML. По классической схеме: выявление, эксплуатация, пост-эксплуатация.\nВсе возможные impact’ы: от DoS до RCE и продвинутой эксплуатации SSRF\nЗнакомство с различными тулзами. Автоматизация выявления и эксплуатации\nСпецифика реализации атак для различных парсеров, языков и ОС\nТребования к участникам workshop:\n2 часа времени\nКомпьютер с VMware Player 5","ru_name":"Эксплуатация атак на XML","ru_speakers":"Алексей Тюрин","day":1,"begintime":"16:30","track":3,"id":28,"name":"Exploitation of XMLbased attacks","description":"XML (Extensible Markup Language): being simply a markup language in essence, it has become a base for various data storage and transmission formats. Currently, XML (broadly speaking) and XML based technologies are a common thread in most information systems, from small to huge. This is why knowing and understanding the attacks connected to XML will be useful for any pen-tester: because they are universal.\n\nThe workshop will feature:\nBasic description of XML and XML documents processing\nDescription of technologies connected with XML (WSDL, SOAP, DTD, XPath, XSLT, XML Signature, XML Encryption и т.д.) and scope of their application\nMost of modern attacks based on XML (the classic agenda: exposure, exploitation, post-exploitation)\nAll possible impacts: from DoS to RCE and advanced SSRF exploitation\nIntroduction to various tools. How to automate exposure and exploitation\nParticularities of performing attacks with different parsers, languages and OS\nRequirements for participants to workshop:\n2 hours\nVMware Player 5","speakers":"Alexey Tuyrin","type":0},{"ru_description":"BeEF — это мощная платформа для взлома клиентской части, постэксплуатации XSS-уязвимостей и злоупотребления незащищенностью браузера жертвы в целом. С точки зрения безопасности каждый браузер индивидуален: тип и версия браузера и операционной системы, установленные плагины, привязка к определенным доменам могут привести к различным дырам в безопасности. Представьте себе Internet Explorer 8 на Windows XP-SP3, без патчей, уязвимый к эксплойту Aurora, или, скажем, Firefox с последними обновлениями, но с уязвимым Java-плагином. Наш фреймворк позволяет пен-тестеру выбирать (в реальном времени) конкретные модули для атаки на каждый браузер, а значит, и особенности его безопасности. \n\nМы начнем наш мастер-класс с демонстрации возможностей BeEF в разнообразных сценариях атаки с применением таких техник, как:\nзапись с клавиатуры;\nсоциальная инженерия;\nполная компрометация хоста;\nнастойчивость;\nтуннелирование через прокси-сервер.\nМы продолжим описанием других ключевых элементов BeEF, например, RESTful API, который позволяет вам писать любые скрипты и при необходимости расширять возможности BeEFс помощью ваших собственных разработок, если, например, у вас на крючке сотни разных браузеров. \n\nИ, наконец, мы расскажем о компрометации внутренней сети изнутри браузера жертвы, покажем наш новый bind shellcode и объясним, как работает кросспротокольная эксплуатация. Благодаря кросспротокольной эксплуатации атаки на браузеры больше не зависят от уязвимостей браузера. Таким образом, количество доступных эксплойтов растет: теперь можно использовать множество уязвимостей разнообразных сервисов во всей внутренней корпоративной сети, включая любой сервис, который реагирует на запросы браузера. Вероятность успеха взлома клиентской части увеличивается, а количество уязвимостей, необходимых для этого, уменьшается. \n\nУ нас больше демонстрационных видео, чем слайдов, так что будет весело. \n\nЕсли вы хотели бы полюбить BeEF и вам нравится безопасность приложений, посещение мастер-класса обязательно. \n\nТребования к участникам workshop:\nКомпьютер с VMware Player 5\n2 часа времени","ru_name":"Все, что вы хотели знать о BeEF","ru_speakers":"Michele \"antisnatchor\" Orru","day":1,"begintime":"11:00","track":4,"id":29,"name":"All you ever wanted to know about BeEF","description":"BeEF is a powerful platform for client-side pwnage, XSS post-exploitation and generally victim browser security-context abuse. Every browser is in a different security context: browser and operating system type/version, plugins installed, specific domain hooked could open different security holes. Imagine Internet Explorer 8 on Windows XP-SP3 lacking patches, vulnerable to the Aurora exploit, or maybe Firefox fully patched with a vulnerable Java plugin. The framework allows the penetration tester to select specific modules (in real-time) to target each browser, and therefore each context. \n\nDuring this workshop we will start with BeEF in action on a number of simulated attack scenarios, employing techniques like:\nkeystrokes logging;\nsocial engineering;\ncomplete host compromise;\npersistence;\ntunneling proxy.\nThe workshop will proceed covering other key features such as the RESTful API, that allows you to script everything and extend BeEF with your custom logic in situations where you can have hundreds of hooked browsers. \n\nFinally, we'll finish the workshop covering internal network compromise from within the victim browser, introducing the new BeEF bind shellcode and explaining how Inter-Protocol Exploitation is used. Inter-protocol Exploitation removes browser-based attacks from being dependent upon browser vulnerabilities. It increases the number of potential exploits to include many service vulnerabilities throughout the internal corporate network. This includes whatever service can be contacted via a browser request. This increases the success rate of client-side exploitation attempts by dramatically increasing the number of vulnerabilities accessible to the attacker. \n\nWe'll have more live demos than slides, so fun is assured.\nIf you want to fall in love with BeEF, and you like application security, you must come to this workshop. \n\nRequirements for participants to workshop:\nComputer with VMware Player 5.\n","speakers":"Michele \"antisnatchor\" Orru","type":0},{"ru_description":"В программу входит:\nМир бесконтактных карт\nОбласти использования сегодня и в будущем\nДавайте уважать ст. 187 и ст. 159 УК РФ\nПримеры неудачно спроектированных систем (горнолыжные и аквапарки, центры развлечений, транспортные системы)\nКакие ошибки допускают разработчики систем\nМинимальная защищенность карт от клонирования\nПрактические советы по защите СКУД от клонов\nСредства скрытого неавторизованного считывания данных на расстоянии\nАвтономный клонер EM-Marine — покажем в работе\nАнтенна EM-Marine для считывания на расстоянии метра — покажем картинку\nТрадиционный ридер ACR122U — при желании легко маскируется\nКуртка-сниффер — гвоздь программы, дадим пощупать и покажем в действии\nСредства защиты от неавторизованного считывания карт\nКакие решения существуют на рынке\nЭкранирующие обложки для биометрического паспорта — покажем в работе\nЭкранирующие держатели для бесконтактных карт — тоже покажем, если успеют прийти\n«Клетка Фарадея» для бесконтактных карт своими руками — убеждаемся, что работает\nМанипуляции с картами 125kHz\nПросто считать\nПросто записать\nНесколько карт в одном устройстве\nГлавная проблема использования EM-Marine\nМанипуляции с картами Mifare Classic\nСпециализированные устройства-эмуляторы\nДуальные смарт-карты JCOP31. Чем они могут помочь злоумышленнику?\nЭмуляция ридером\nКоммуникаторы с NFC\nСофт и железо для манипуляций\nИнструментарий для взлома карт Mifare Classic\nПолучение ключей из карты Mifare Classic — демонстрация\nMifare Zero\nКарты с перезаписываемым блоком производителя\nКакие они бывают\nОбзор софта для записи\nДемонстрация результата\nСредства защиты от клонов на уровне СКУД\n\n\nТребования к участникам workshop:\n4 часа\nДорогие друзья!\nВ нашем воркшопе предполагается 2 вида участия.\nВы можете просто посмотреть, записать и попробовать повторить дома то, что будет происходить.\nНо будет намного интереснее, если вы принесете с собой ноутбук с ридером ACR122U. И параллельно с нами попробуете повторить манипуляции с бесконтактными картами. Таким образом, у вас будет возможность получить моментальную подсказку, если что-то не получается.\nИзвлечение ключей планируется под линь, а запись нулевого блока софтом — под винду. Позаботьтесь заранее, чтобы ноутбук был заряжен, а ридер виден в системе.\nИ помните, что все манипуляции с картами вы совершаете на свой страх и риск, принимая всю ответственность за свои действия на себя.","ru_name":"RFID: Джокеры в рукаве","ru_speakers":"Кирилл Саламатин (aka Del), Андрей Цуманов","day":1,"begintime":"14:30","track":4,"id":30,"name":"RFID: Jokers in the sleeve","description":"Included:\nThe world of contactless cards\nScope of usage today and in the future\nLet’s respect legislation\nExamples of poorly designed systems (mountain skiing and water parks, entertainment centers, transport systems)\nThe mistakes that developers make\nMinimum defense from card cloning\nHow to protect access control systems from clones\nTools that allow concealed unauthorized data reading from a distance\nAutonomous EM-Marine cloner: we will show how it works\nEM-Marine antennae to read from one meter distance: we will show a picture\nACR122U traditional reader: easily concealed if necessary\nThe sniffer jacket, our drawing card: we will let you touch it and show how it works\nTools to defend from unauthorized card reading\nWhich solutions are there on the market?\nScreening covers for a biometric passport: we will show how they work\nScreening contactless card keepers: will show as well if we receive them on time\nFaraday shield for contactless cards DIY: we will confirm that it works\nManipulating 125kHz cards\nEasy to read\nEasy to write\nSeveral cards in one device\nThe main problem of using EM-Marine\nManipulating Mifare Classic cards\nSpecial emulating devices\nDual JCOP31 smart cards. How can they help an attacker?\nEmulation by reader\nCommunicators with NFC\nSoftware and hardware for manipulations\nTools to hack Mifare Classic\nExtracting keys from Mifare Classic: demo\nMifare Zero\nRewritable RFID cards\nWhich cards are those?\nOverview of writing software\nDemo of the results\nTolls to defend from clones on the access control system level\n\n\nRequirements for participants to workshop:\n4 hours\nDear friends!\nThere are two ways to participate in our workshop.\nYou can simply look at what will happen, write it down, and try to repeat it at home.\nBut it will be much more interesting to bring a laptop with an ACR122U reader and try to repeat our contactless manipulations right there. This way, you will be able to get an immediate hint if you fail to do something.\nKeys are supposed to be extracted under Linux and 0 blocks to be written under Windows. Make sure your laptop is charged and the reader is visible in the system.\nRemember that you manipulate cards at your own risk and you are fully responsible for the consequences.","speakers":"Kirill Salamatin (aka Del), Andrey Tsumanov","type":0},{"ru_description":"В программу входит:\nМир бесконтактных карт\nОбласти использования сегодня и в будущем\nДавайте уважать ст. 187 и ст. 159 УК РФ\nПримеры неудачно спроектированных систем (горнолыжные и аквапарки, центры развлечений, транспортные системы)\nКакие ошибки допускают разработчики систем\nМинимальная защищенность карт от клонирования\nПрактические советы по защите СКУД от клонов\nСредства скрытого неавторизованного считывания данных на расстоянии\nАвтономный клонер EM-Marine — покажем в работе\nАнтенна EM-Marine для считывания на расстоянии метра — покажем картинку\nТрадиционный ридер ACR122U — при желании легко маскируется\nКуртка-сниффер — гвоздь программы, дадим пощупать и покажем в действии\nСредства защиты от неавторизованного считывания карт\nКакие решения существуют на рынке\nЭкранирующие обложки для биометрического паспорта — покажем в работе\nЭкранирующие держатели для бесконтактных карт — тоже покажем, если успеют прийти\n«Клетка Фарадея» для бесконтактных карт своими руками — убеждаемся, что работает\nМанипуляции с картами 125kHz\nПросто считать\nПросто записать\nНесколько карт в одном устройстве\nГлавная проблема использования EM-Marine\nМанипуляции с картами Mifare Classic\nСпециализированные устройства-эмуляторы\nДуальные смарт-карты JCOP31. Чем они могут помочь злоумышленнику?\nЭмуляция ридером\nКоммуникаторы с NFC\nСофт и железо для манипуляций\nИнструментарий для взлома карт Mifare Classic\nПолучение ключей из карты Mifare Classic — демонстрация\nMifare Zero\nКарты с перезаписываемым блоком производителя\nКакие они бывают\nОбзор софта для записи\nДемонстрация результата\nСредства защиты от клонов на уровне СКУД\n\n\nТребования к участникам workshop:\n4 часа\nДорогие друзья!\nВ нашем воркшопе предполагается 2 вида участия.\nВы можете просто посмотреть, записать и попробовать повторить дома то, что будет происходить.\nНо будет намного интереснее, если вы принесете с собой ноутбук с ридером ACR122U. И параллельно с нами попробуете повторить манипуляции с бесконтактными картами. Таким образом, у вас будет возможность получить моментальную подсказку, если что-то не получается.\nИзвлечение ключей планируется под линь, а запись нулевого блока софтом — под винду. Позаботьтесь заранее, чтобы ноутбук был заряжен, а ридер виден в системе.\nИ помните, что все манипуляции с картами вы совершаете на свой страх и риск, принимая всю ответственность за свои действия на себя.","ru_name":"RFID: Джокеры в рукаве","ru_speakers":"Кирилл Саламатин (aka Del), Андрей Цуманов","day":1,"begintime":"16:30","track":4,"id":31,"name":"RFID: Jokers in the sleeve","description":"Included:\nThe world of contactless cards\nScope of usage today and in the future\nLet’s respect legislation\nExamples of poorly designed systems (mountain skiing and water parks, entertainment centers, transport systems)\nThe mistakes that developers make\nMinimum defense from card cloning\nHow to protect access control systems from clones\nTools that allow concealed unauthorized data reading from a distance\nAutonomous EM-Marine cloner: we will show how it works\nEM-Marine antennae to read from one meter distance: we will show a picture\nACR122U traditional reader: easily concealed if necessary\nThe sniffer jacket, our drawing card: we will let you touch it and show how it works\nTools to defend from unauthorized card reading\nWhich solutions are there on the market?\nScreening covers for a biometric passport: we will show how they work\nScreening contactless card keepers: will show as well if we receive them on time\nFaraday shield for contactless cards DIY: we will confirm that it works\nManipulating 125kHz cards\nEasy to read\nEasy to write\nSeveral cards in one device\nThe main problem of using EM-Marine\nManipulating Mifare Classic cards\nSpecial emulating devices\nDual JCOP31 smart cards. How can they help an attacker?\nEmulation by reader\nCommunicators with NFC\nSoftware and hardware for manipulations\nTools to hack Mifare Classic\nExtracting keys from Mifare Classic: demo\nMifare Zero\nRewritable RFID cards\nWhich cards are those?\nOverview of writing software\nDemo of the results\nTolls to defend from clones on the access control system level\n\n\nRequirements for participants to workshop:\n4 hours\nDear friends!\nThere are two ways to participate in our workshop.\nYou can simply look at what will happen, write it down, and try to repeat it at home.\nBut it will be much more interesting to bring a laptop with an ACR122U reader and try to repeat our contactless manipulations right there. This way, you will be able to get an immediate hint if you fail to do something.\nKeys are supposed to be extracted under Linux and 0 blocks to be written under Windows. Make sure your laptop is charged and the reader is visible in the system.\nRemember that you manipulate cards at your own risk and you are fully responsible for the consequences.","speakers":"Kirill Salamatin (aka Del), Andrey Tsumanov","type":0},{"ru_description":null,"ru_name":"Стремись быть собой","ru_speakers":"Felix 'FX' Lindner","day":2,"begintime":"10:00","track":0,"id":32,"name":"Keynote: Try Harder 2 Be Yourself","description":null,"speakers":"Felix 'FX' Lindner","type":0},{"ru_description":null,"ru_name":"Кофе-брейк","ru_speakers":null,"day":2,"begintime":"10:45","track":0,"id":33,"name":"Coffe break","description":null,"speakers":null,"type":0},{"ru_description":"Сейчас все чаще и чаще программисты используют NoSQL базы данных, для различных приложений. Методы атак на NoSQL еще мало изучены и не так распространены как обычные SQL injections. В докладе рассмотрены ранее не публиковавшиеся методы атак на базу данных MongoDB. ","ru_name":"Удар по mongoDB","ru_speakers":"Михаил Фирстов","day":2,"begintime":"11:00","track":1,"id":34,"name":"A blow against MongoDB","description":"More and more software developers use NoSQL databases for various applications. Attack techniques for NoSQL are barely studied and not as popular as your usual SQL injections. In this presentation, we will describe the techniques of MongoDB attacks which have not been published before. ","speakers":"Michail Firstov","type":0},{"ru_description":"Раскрытие исходного кода – это святой Грааль в мире раскрытия информации. Пожалуй, исходный код — самое важное, что может украсть хакер. Такую информацию можно использовать для поиска возможных уязвимостей в коде, для выяснения логики приложения и обнаружения вшитых данных. \n\nПоскольку уязвимости, позволяющие раскрыть исходный код, далеко не всегда под рукой, сложилось мнение, будто безопасность через сокрытие — не совсем безнадежный подход к защите информации. Но теперь очевидно, что оно ложно. \n\nАтаки типа Divination («ясновидение») — это новая техника атак, направленных на сбор информации, которая дает возможность предсказать структуру памяти и исходного кода компонентов приложения и применять метод «черного ящика» с беспрецедентной точностью. \n\nЭти техники были воплощены в Diviner — новом расширении для OWASP ZAP, предназначенном для поиска следов прямых и косвенных уязвимостей. Оно также позволяет аудиторам получить фрагменты серверного исходного кода и визуализировать структуру серверной памяти, таким образом упрощая для аудиторов процесс принятия решений и позволяя им разумно распорядиться своим временем и усилиями. ","ru_name":"The Diviner — Прорыв в цифровом ясновидении — Как получить доступ к исходному коду и серверной памяти ЛЮБОГО приложения","ru_speakers":"Shay Chen","day":2,"begintime":"11:50","track":1,"id":35,"name":"The Diviner — Digital Clairvoyance Breakthrough — Gaining Access to the Source Code & Server Side Memory Structure of ANY Application","description":"The Crown Jewel of information disclosure, source code disclosure, is arguably the most significant information an attacker can obtain, and can be used to expose potential code-level vulnerabilities, logic, and hard coded information. \n\nSince vulnerabilities that disclose source code are not always available, we were lead to believe that the concept of security by obscurity can provide some level of protection, as fragile as it may be… but not anymore. \n\nDivination Attacks, a new breed of information gathering attacks, provide the means to predict the structure of the memory and source code of application components, using black box techniques with unparalleled accuracy. \n\nThese techniques were implemented in Diviner — a new OWASP ZAP extension, which can be used to locate leads for direct and indirect vulnerabilities, and can also enable testers to fingerprint fragments of the server-side source code and visualize the structure of the server memory, thus, enhancing the tester's decision making process and enabling him to properly invest his time and efforts.","speakers":"Shay Chen","type":0},{"ru_description":null,"ru_name":"Перерыв","ru_speakers":null,"day":2,"begintime":"12:35","track":1,"id":36,"name":"Break\n","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Обед","ru_speakers":null,"day":2,"begintime":"13:00","track":0,"id":37,"name":"Lunch","description":null,"speakers":null,"type":0},{"ru_description":"В этой презентации мы внимательно рассмотрим внутренние механизмы управления пользовательской сессией Ruby on Rails. Мы представим вам обзор классических паттернов аутентификации и авторизации. Далее мы раскроем типичные недостатки аутентификации и авторизации в приложениях Ruby on Rails. Мы продемонстрируем, как небрежно относятся к безопасности многие разработчики свободного ПО на Ruby on Rails, причем возможность получить административных привилегий во многих из упомянутых веб-приложений — лишь одно из следствий этой небрежности. А также мы оценим последствия их недобросовестности в реальном мире — с помощью critical.io. ","ru_name":"В мире безграничных возможностей я стал BAh7BkkiDHVzZXJfaWQGOgZFVGkG","ru_speakers":" joernchen из Phenoelit","day":2,"begintime":"14:30","track":1,"id":38,"name":"They told me I could be anything, so I became BAh7BkkiDHVzZXJfaWQGOgZ","description":"In this presentation, we'll have a deeper look at Ruby on Rails' own session handling mechanisms. An overview of typical authentication and authorization patterns will be given. Alongside this, we will discover typical flaws within Ruby on Rails applications regarding authentication and authorization. A certain negligence of quite a lot of Open Source Ruby on Rails developers will be demonstrated, with gain of admin privileges on a broad range of these web applications being one of the many implications of this negligence. Additionally, with the aid of critical.io, the real world impact of this common malpractice will be evaluated.","speakers":"joernchen","type":0},{"ru_description":"В докладе рассматриваются уязвимости серверной подделки запроса (Server Side Request Forgery — SSRF) с точки зрения практического применения их для проведения различных атак. Приводятся различные уязвимости и атаки с использование сокетов, начиная от управления НТТР ответом веб-сервера, операций с СУБД и до выполнения произвольного кода. Отдельное внимание уделяется описанным выше атакам, релевантным для PHP интерпретатора. Приведенные методы и техники проведения атак были разработаны и успешно использованы в ходе проведения аудитов безопасности реальных веб-приложений. ","ru_name":"Атаки SSRF и сокеты: шведский стол уязвимостей","ru_speakers":"Владимир Воронцов, Александр Головко","day":2,"begintime":"15:20","track":1,"id":39,"name":"SSRF attacks and sockets: smorgasbord of vulnerabilities","description":"The report described server request forgery vulnerabilities (Server Side Request Forgery — SSRF) in terms of their practical applications to perform various attacks. The various vulnerabilities and attacks with the using sockets were researched. Such as controlling of the HTTP response, database operations, and even remote code execution. Special attention is given to the above attacks, relevant for the PHP interpreter. The above methods and techniques of the attacks have been developed and successfully used in the course of security audits of real web applications.","speakers":"Vladimir Vorontsov, Alexander Golovko","type":0},{"ru_description":null,"ru_name":"Перерыв на кофе","ru_speakers":null,"day":2,"begintime":"16:05","track":0,"id":40,"name":"Coffe break","description":null,"speakers":null,"type":0},{"ru_description":"Ну да, это доклад про XML. Но в нем будет классный новый контент! Вы хотели бы прочитать часть исходного кода Adobe Reader? Черный список XML заставил вас биться головой об стену на вашем последнем пен-тесте? Вы мечтаете подсунуть шелл в процедуру верификации XML Digital Signature? Я попробую доказать вам, что ломать XML намного веселее, чем кажется! ","ru_name":"Вот за что я люблю взломы XML!","ru_speakers":"Nicolas Gregoire","day":2,"begintime":"16:30","track":1,"id":41,"name":"That's why I love XML hacking!","description":"Yes, that's a talk about XML. But with exciting new content! You want to read part of the Adobe Reader source code? You have banged your head against a XML blacklist during your latest pentest? You wonder how to pop a shell during verification of a XML Digital Signature? I'll try to show you that XML hacking is sexier than most people think! ","speakers":"Nicolas Gregoire","type":0},{"ru_description":"Вы устали просматривать сотни измененных функций при сравнении свежего Flash Player'a? Вам надоел Turbodiff и PatchDiff? Вам надоело зарабатывать гроши на 1-day эксплойтах? \n\nТогда этот доклад для Вас! ","ru_name":"The Art of Binary Diffing or how to find 0-dayz for free","ru_speakers":"Никита Тараканов","day":2,"begintime":"17:20","track":1,"id":42,"name":"The Art of Binary Diffing or how to find 0dayz for free","description":"Are you sick of scrolling through hundreds of changed functions whenever Flash Player is patched? Are you fed up with Turbodiff and PatchDiff? Are you tired of earning peanuts on 1-day exploits? \n\nThen, this talk is for you! ","speakers":"Nikita Tarakanov","type":0},{"ru_description":null,"ru_name":"Кофе-брейк","ru_speakers":null,"day":2,"begintime":"18:00","track":1,"id":43,"name":"Coffe break","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Ключевой доклад:Безопасность мобильных приложений","ru_speakers":"Дмитрий 'D1g1' Евдокимов, Александр Поляков","day":2,"begintime":"18:30","track":0,"id":44,"name":"Closing Keynote. \"Security of Mobile applications\"","description":null,"speakers":" Alexander Polyakov, Dmitriy \"D1g1\" Evdokomov","type":0},{"ru_description":null,"ru_name":"ZeroDay  show","ru_speakers":null,"day":2,"begintime":"19:00","track":0,"id":45,"name":"ZeroDay  show","description":null,"speakers":null,"type":0},{"ru_description":null,"ru_name":"Закрытие конференции","ru_speakers":null,"day":2,"begintime":"19:30","track":0,"id":46,"name":"Closing","description":null,"speakers":null,"type":0},{"ru_description":"В июле 2011 года Apple представила iCloud. Эта технология позиционируется как преемник MobileMe. iCloud — это универсальный облачный сервис для устройств Apple, позволяющий их владельцам делиться информацией (контактами, заметками календаря, приложениями, фотографиями), а также загружать резервные копии данных из операционной системы iOS напрямую в iCloud. Такой подход позволяет при необходимости восстанавливать данные в любой момент. По результатам недавних подсчетов, сейчас в базе iCloud уже 125 миллионов пользователей (это почти половина от общего количества проданных устройств на базе iOS). \n\nВ нашем докладе будут проанализированы безопасность и приватность сервиса резервного копирования iCloud. Мы опишем его архитектуру (если вы думаете, будто ваши бэкапы хранятся в дата-центре Apple, то нам придется вас огорчить) и протокол, по которому устройства на базе iOS общаются с iCloud, чтобы загружать и скачивать резервные копии. Мы объясним, как iCloud шифрует бэкапы и почему их шифрование (в отличие от шифрования оффлайновых бэкапов) практически не является препятствием. \n\nНаша цель — столкнуть аудиторию с реальностью и донести до вас, что с того момента, как вы начинаете пользоваться резервным копированием iCloud, все ваши данные принадлежат Apple или кому угодно, кто знает ваш Apple ID и пароль. ","ru_name":"Темная и светлая сторона (не)безопасности iCloud","ru_speakers":"Андрей Беленко, Дмитрий Скляров","day":2,"begintime":"11:00","track":2,"id":47,"name":"Dark and Bright Sides of iCloud (In) security”","description":"In July 2011 Apple has introduced iCloud, a successor to MobileMe. iCloud is a comprehensive cloud service for Apple devices that allows to share data (such as contacts, calendars, application files, photos) among devices, as well as to backup data from iOS devices directly to iCloud. With this approach there is always a fresh backup copy available in iCloud should there be need to restore. Recent estimates report iCloud user base to be as large as 125 million users (which is almost half of the number of iOS devices sold). \n\nIn this talk we will approach the security and privacy of this “Backup to iCloud” feature. We will describe the architecture of the iCloud backups (if you think that your backups are stored in the Apple's datacenter you're soooo mistaken) and the protocol iOS devices use to talk to iCloud to backup and restore data. We will explain how iCloud backups are encrypted and why this encryption (unlike the encryption of offline backups) is no problem. \n\nOur goal is to provide the audience with iCloud “reality check” and to show that the moment you enable iCloud backups all your data belongs to Apple or to anyone who knows your Apple ID and password.","speakers":"Andrey Belenko, Dmitry Sklyarov","type":0},{"ru_description":"Техника принуждения пользователя к установке корневого сертификата и обзор последствий установки: контроль устройства через фальшивый Push Notification Server и раскрытие SSL-трафика. ","ru_name":"MiTM-нападение на iOS. Техника и последствия","ru_speakers":"Алексей Трошичев","day":2,"begintime":"11:50","track":2,"id":48,"name":"MiTM attack on iOS: Methodology and consequencese","description":"How to make a user install root certificate and a review of installation consequences: control of the device via fake Push Notification Server and SSL traffic disclosure","speakers":"Alexey Troshichev","type":0},{"ru_description":null,"ru_name":"Перерыв","ru_speakers":null,"day":2,"begintime":"12:35","track":2,"id":49,"name":"Break","description":null,"speakers":null,"type":0},{"ru_description":"От А до Я: история низкоуровневого взлома read-only области eMMC-памяти смартфона HTC Desire HD.\n\nРасскажу о том, как научиться писать в самый закрытый раздел памяти HTC-смартфона, детективная история включает в себя реверсивный инжиниринг китайского устройства для разблокировки/взлома телефонов HTC, обнаружение и кооперацию с истинным разработчиком ключевого элемента и детальное описание механизма хака, позволяющего снимать заводские read-only флаги с микросхемы памяти.\nParanoid Android: создание телефона-оборотня с использованием криптографии.\n\nОпишу способ создать криптотелефон внутри телефона так, чтобы о его существовании никто не догадался, как решить неизбежные технические проблемы и почему только такая защита даст 99% защиту от попадания мобильных данных в чужие руки.\nЛожная безопасность: обзор способов извлечения данных из гуглофона.\n\nРасскажу на примере HTC Desire HD, как при наличии доступа к устройству взломать и извлечь данные из смартфона, о разделении групп риска и специальном оборудовании, которое может взломать и прошить телефон даже без загрузки в ОС (S-OFF через GoldCard средствами XTC Clip и его аналогов).","ru_name":"За кулисами Android: варианты атаки и радикальные меры защиты»","ru_speakers":"Сергей Карасиков","day":2,"begintime":"14:30","track":2,"id":50,"name":"Android behind the scenes: possible attacks and radical defense measures\"","description":"All the way from A to Z: the story of a low-level hack of HTC Desire HD eMMC memory read-only area.\n\nI will tell you how to write to the most restricted partition of HTC smartphones. My detective story includes reverse engineering of a Chinese device which led to unlocking and breaking HTC phones; exposure and cooperation with the true developer of the key element; a detailed description of the hack mechanism which allows removing factory read-only flags from the memory chip.\nParanoid Android: creating a turncoat phone using cryptography.\n\nI will describe a way to create a cryptophone inside a phone so that nobody will know it is there, how to solve inevitable technical issues, and why this is the only kind of protection that 99% protects your mobile data from leaking into unwanted hands.\nFake security: a review of ways to gain data from a Google phone. I will use the example of HTC Desire HD to show you how, given access to the device, it is possible to hack it and derive the data, and I will tell you about risk group segregation and special tolls which can hack a phone and replace firmware without even loading into OS (S-OFF via GoldCard with the help of XTC Clip and its counterparts).","speakers":"Sergey Karasikov","type":0},{"ru_description":"Как быстро найти много уязвимостей нулевого дня в широко распространённых приложениях, и после этого не иметь проблем с эксплуатацией? Ответ: присмотреться повнимательнее к «баянам» и к якобы «неэксплуатируемым» находкам. Мы снова поднимаем тему уязвимостей некорректной загрузки DLL (Insecure Library Loading или DLL Hijacking), чтобы развеять миф о том, что они тривиальны, бесполезны и не существуют. Будут рассмотрены неочевидные нюансы эксплуатации, методы нивелирования пользовательского интерактива и другие техники, которые превращают ограниченный на первый взгляд вектор в кратчайший путь до цели.","ru_name":"История о несуществующих уязвимостях нулевого дня, стабильных эксплойтах для бинарных приложений и пользовательском интерактиве","ru_speakers":"Алиса Шевченко","day":2,"begintime":"15:20","track":2,"id":51,"name":"A story about nonexistent 0-days, stable exploits for binary applications and user interactions","description":"How to find a lot of 0-days in popular software quickly and how to have no problem exploiting them later? Answer: you should look into old stories and so called inexploitable bugs. We will raise the topic of Insecure Library Loading, or DLL Hijacking again to dispel the myth about them being trivial, useless and nonexistent. The talk includes non-obvious exploitation tricks, ways to ignore user interactions and other techniques which turn the vector that seems terminated at first into the shortcut to our goal","speakers":"Alisa Shevchenko","type":0},{"ru_description":"Что может быть интереснее исследования безопасности информационных систем? Бинго! Исследование безопасности технологий, призванных обеспечивать безопасность. \n\nВ докладе будут рассмотрены вопросы безопасности трекинговых систем. Узнать в подробностях маршрут движения инкассаторской машины? Легко! Расширить область, в пределах которой могут перемещаться условно освобожденные преступники? Да пожалуйста! Посмотреть, куда и с какой скоростью возит пельмени ваш конкурент? Получите, распишитесь. Узнать, где стоят машины с незакрытым дверями? Готово. Что-нибудь расскажем. Что-нибудь покажем. Может быть. ","ru_name":"Где моя тачка, чувак?","ru_speakers":"Дмитрий 'chipik' Частухин, Глеб Чербов","day":2,"begintime":"16:30","track":2,"id":52,"name":"FastTrack:\"Where is my car dude?\", Dmitriy","description":"What can be more interesting than a security research of an information system? Bingo! A security research of a technology which was designed to ensure security. \n\nThe issues of tracking systems security will be discussed in this presentation. Know the details of cash-in-transit vehicle route? Easy as pie! Expand the area which criminals on probation can move within? No sweat! Look up the direction and speed of noodles transportation by your competitor? Signed, sealed and delivered. Know the locations of cars with unlocked doors? Done. We will tell you something. We will show you something. Maybe. ","speakers":"\"Chipik\" Chastuchin, Gleb Cherbov","type":0},{"ru_description":"Нравится нам или нет, парольная аутентификация остаётся актуальной, в том числе и при использовании многофакторной аутентификации, а утечка базы данных, содержащей хеши паролей, является одним из рисков. Для снижения последствий такой утечки используются специализированные методы хеширования, которые на каждую проверку пароля расходуют значительное процессорное время (bcrypt, PBKDF2), а также оперативную память (scrypt). К сожалению, при сравнительно низком требуемом времени проверки пароля, особенно в сочетании с необходимостью обработки одновременно многих попыток аутентификации, расход оперативной памятив scrypt оказывается недопустимо низким, вплоть до того, что scrypt может не быть лучше, чем гораздо более старый bcrypt. В моем докладе я предложу альтернативный подход, при котором может быть задействован произвольно большой объем памяти в сочетании с произвольно низким временем проверки пароля и с возможностью производить много таких проверок одновременно. Я также рассмотрю «за» и «против» этого подхода. Современное серверное оборудование позволяет нам использовать десятки гигабайт оперативной памяти (в качестве эдакого ПЗУ, особенного для каждой организации), что ограничивает использование существующего оборудования для атаки (в частности, узлов ботнета) и дает нам запас времени. Дальнейшее развитие подхода — в использовании не только оперативной памяти, но также SSD и потенциально даже NAS/SAN на основе SSD. \n\nЭто позволяет достичь целей, схожих с целями концепции «blind hashing» («хеширование вслепую»), позже названной «security through obesity» («безопасность через ожирение»), которая была предложена после утечки базы хешей из LinkedIn этим летом. ","ru_name":"Новое в хешировании паролей: ROM-port-hard функции (развитие идей scrypt и security through obesity)","ru_speakers":" Александр Песляк","day":2,"begintime":"16:45","track":2,"id":53,"name":"Fast Track: New developments in password hashing: ROM-port-hard functions (building upon the ideas of scrypt and security through obesity)","description":"Like it or not, password authentication remains relevant (including when used as one of several authentication factors), and password hash database leaks remain a risk. To mitigate the risk impact, computationally expensive (bcrypt, PBKDF2) and more recently also memory-hard (scrypt) password hashing methods have been introduced. Unfortunately, at relatively low target running time and with the need to perform multiple authentication attempts concurrently, scrypt's memory cost ends up being unreasonably low, up to the point where scrypt may not be better than the much older bcrypt. In my talk, I will propose and discuss the pros and cons of an alternative approach, where an arbitrarily large lookup table may be used along with any target running time and in parallel by multiple concurrent authentication attempts. With contemporary server hardware, the lookup table may occupy tens of gigabytes of RAM (using it as a site-specific ROM), which limits attackers' use of pre-existing hardware (such as botnet nodes), thereby buying the defender time. Further development of the approach is in use of not only RAM, but also SSDs and potentially even a NAS/SAN based on SSDs. This achieves goals similar to those of the “blind hashing” concept, later dubbed “security through obesity”, which was suggested after the leak of passwords from LinkedIn this summer. ","speakers":"Alexander \"SolarDesigner\" Peslyak","type":0},{"ru_description":"Использование технологии Flash во вредоносных целях известно давно [1, 2, 3, 4]. В докладе речь пойдет об использовании потенциала Flash-баннерных сетей для реализации массовых CSRF-атак. В докладе будут представлены результаты исследования наиболее популярных баннерных сетей на возможность включения в ротацию «нехороших» баннеров, а также реальные примеры сервисов, на которые удобно проводить CSRF-атаки через баннерные сети. Не будет оставлен без внимания и такой вектор атаки, как XSS через CSRF. \n\n[1]http://events.ccc.de/congress/2008/Fahrplan/events/2596.en.html\n[2]http://blog.guya.net/2008/09/14/encapsulating-csrf-attacks-inside-massively-distributed-flash-movies-real-world-example/\n[3] http://habrahabr.ru/post/143345/\n[4] https://www.seclab.tuwien.ac.at/papers/flash-acsac.pdf","ru_name":"Массовые CSRF-атаки через Flash-рекламу","ru_speakers":"Кирилл Самосадный","day":2,"begintime":"17:00","track":2,"id":54,"name":"Fast Track: Mass CSRF attacks via Flash ads","description":"Usage of Flash technology with malicious goals has been known for long [1, 2, 3, 4]. The talk is dedicated to using the opportunities of Flash banner networks for mass CSRF attacks. I will describe the results of a research where popular banner networks were searched for the possibility to put “bad” banners online, as well as actual examples of services which are convenient to attack via CSRF through banner networks. I will also pay attention to XSS via CSRF. ","speakers":"Kirill Samosadny","type":0},{"ru_description":"В наши дни RE без автоматизации определенных задач уже нельзя себе представить. И Python стал идеальным и беспощадным оружием в руках умелого реверсера, который не разменивается по мелочам, а автоматизирует все и вся. Спрос рождает предложение, и появилось достаточно большое количество Python-проектов, которые хорошо или плохо известны, узко- или широконаправленны, являются плагинами или отдельными приложениями, но всех их объединяет одно — это арсенал реверс-инженера для погружения в жестокий бинарный мир. И специально для того, чтобы не потеряться в обилии Python-оружия, было решено сделать сайт о них и представить его на конференции. ","ru_name":"Питоновский арсенал для реверса","ru_speakers":"Дмитрий 'D1g1' Евдокимов","day":2,"begintime":"17:20","track":2,"id":55,"name":"Fast Track:Python Arsenal for RE","description":"Nowadays, RE is unimaginable without automation of some tasks. And Python has become a perfect merciless weapon in the hands of a seasoned reverser who does not squander his talents on trifles but rather automates everything that he can. Demand breeds supply, so quite a few Python projects have appeared, which are well-known or unknown at all, which have a wide or narrow direction, which are plugins or separate applications. But they all have something in common: they are the arsenal of a reverse engineer to dive into the cruel world of binary. To keep hackers from getting lost in the flood of Python weapons, we have decided to create a special website about them and present it at the conference. ","speakers":"Dmitriy \"D1g1\" Evdokimov","type":0},{"ru_description":"В презентации будет рассказано как с минимальными затратами построить систему мониторинга событий безопасности, а также какие события искать. ","ru_name":"Как поймать своего „хакера“ или безопасность „на коленках“","ru_speakers":"Игорь Гоц, Сергей Солдатов","day":2,"begintime":"17:35","track":2,"id":56,"name":"Fast Track: How to catch your hacker, or Makeshift security","description":"We will teach you how to build a security incident monitoring system at minimum expenses and which incidents to look for. ","speakers":"Igor Gots, Sergey Soldatov","type":0},{"ru_description":"В докладе будут рассмотрены массовые кампании распространения вредоносного ПО, акцент будет сделан на техники обхода автоматического детектирования фактов наличия опасного контента на скомпрометированных серверах, которые встречались в 2012 году. Рассматриваемые примеры будут включать:\nдинамическую генерацию имен доменов с вредоносным контентом в реальном времени;\nпримеры инфицирования с использованием крупных российских баннерных сетей;\nпримеры с короткоживущими доменам, время жизни которых гораздо меньше времени добавления в блэклисты;\nпримеры атак с легальных ресурсов, у которых были скомпрометированы учетные записи управления DNS;\nи другие интересные случаи.","ru_name":"Техники обхода автоматических систем детектирования вредоносного контента — интересные примеры 2012 года","ru_speakers":"Федор Ярочкин, Владимир Кропотов, Виталий Четвертаков","day":2,"begintime":"17:50","track":2,"id":57,"name":"Fast Track: Techniques of automatic malware detection system bypass: interesting examples of 2012","description":"In this presentation, mass malware distribution campaigns will be described, particularly the bypass techniques for automatic detection of dangerous content on compromised servers which have been spotted during 2012. The examples we will show will include:\nreal-time dynamic malicious domain name generation;\nexamples of infection in large Russian banner networks;\nexamples of domains which have a shorter lifespan than the time needed to blacklist them;\nexamples of attacks from legal resources which have had their DNS administration accounts compromised;\nand other interesting cases.\n","speakers":" Fyodor Yarochkin, Vladimir Kropotov, Vitaly Chetvertakov","type":0},{"ru_description":"В настоящее время заражение компьютерного железа перестало быть мифом. Например, Rakshasa, представленная общественности на Defcon, обладает функционалом заражения BIOS и PCI ROM (LAN, CDROM). Автор данного доклада решил продолжить исследования в направлении инфицирования программной составляющей оборудования, и проверил на практике возможность заражения современных 3G модемов. \n\nВ качестве объекта для исследования использовались 3G модемы операторов «Большой Тройки»: МТС, Билайн, Мегафон. Разработано программное обеспечение для кроссплатформенного заражения (Windows, Linux, MacOS X) образа виртуального привода CD-ROM.","ru_name":"Заражение 3G модемов","ru_speakers":"Олег Купреев","day":2,"begintime":"18:00","track":2,"id":58,"name":"Fast Track: 3G modem infection","description":"Hardware infection is not a myth anymore. For instance, Rakshasa, which was shown at Defcon, is capable of infecting BIOS and PCI ROM (LAN, CDROM). The author of this paper decided to continue research towards infecting the software of the devices and checked the practical possibility to infect a modern 3G modem. \n\nThe 3G modems of the Big Three mobile network operators were used: MTS, BeeLine, Megafon. Software for cross-platform infection (Windows, Linux, MacOS X) of virtual CD-ROM images has been developed. ","speakers":"Oleg Kupreev","type":0},{"ru_description":"Доклад затрагивает актуальные вопросы отношения службы ИБ к своим обязанностям, образованию сотрудников, а также вытекающие из этого уязвимости, преимущественно технического характера. В частности, внимание будет уделено проблемам безопасности в парольных политиках, разграничении доступа, обновлении ПО и перехвату трафика с наглядными примерами реальных ситуаций, и чем это было и может быть чревато для организаций с безответственным подходом. И как же так получилось что подобные ошибки стали систематичными в большинстве организаций. ","ru_name":"Типичные ошибки ИБ в корпорациях и крупных организациях","ru_speakers":"Соболев Евгений","day":2,"begintime":"18:15","track":2,"id":59,"name":"Fast Track: Typical information security flaws in corporations and large enterprises","description":"This presentation refers to the attitude that ISOs have towards their duties and personnel education, and to the vulnerabilities that ensue, mostly technical ones. In particular, I will pay attention to security issues in password policies, access control, software updates, and traffic interception with practical cases. I will explain what consequences negligent companies have faced and will be facing. And how could such flaws become typical for most companies? ","speakers":"Eugeny Sobolev","type":0},{"ru_description":"Браузер — это окно в мир Интернета, поэтому неудивительно, что через окно различные неблагоприятные элементы лезут прямо в наш дом. Данный курс рассчитан на тех, кому интересно понять, как эти элементы проникают в дом, эксплуатируя такие уязвимости браузера (или его плагинов), как переполнение буфера или использование памяти после освобождения. Кроме того, будет рассмотрено в деталях, как работают и обманываются различные защитные механизмы, которые должны препятствовать проникновению. Мы изучим типовые атаки на защитные механизмы ОС и ПО, такие как DEP/ASLR/SafeSEH/GS, рассмотрим технику HeapSpray и выполним произвольный код в обход всех защит! Все атаки и эксплойты будут воспроизведены участниками в ходе воркшопа, что позволит им самостоятельно оценить угрозы и реальные возможности подобных атак. \n\nВ программу входит:\nТиповые проблемы браузера (на примере IE и его плагинов)\nЧто такое BoF, и как взять контроль?\nRET\nSEH\nvTable\nЧем эксплуатация уязвимостей плагинов отличается от эксплуатации уязвимостей самого браузера?\nОсобенности эксплуатации (чем отличается от серверного ПО, других браузеров)\nHeapSpray in IE9\nобход защитных механизмов\nванильный DEP (IE6-7)\nобход permanent DEP+ASLR (если есть модуль без поддержки ASLR)\nROP (StackPivot)\nGS+DEP+ASLR\nsafeSeh+GS+DEP+ASLR\nобход ASLR (даже если все модули с поддержкой ASLR!)\nЧто такое UaF, и как взять контроль?\nЧто мешает UaF?\nОтличия от Firefox/Opera/Safari/Chrome\n\n\nНа всех ключевых этапах будет получен calc.exe, то есть участники сами будут обходить защитные методы и собирать эксплойты — для этого будут подробно разобраны необходимые детали и суть атак. \n\nУчастник получит:\nПринципы эксплуатации уязвимостей в браузере IE\nПереполнение буфера в стеке\nИспользование памяти после освобождения\nНавыки создания боевых эксплойтов для браузера\nПонимания принципа работы передовых защитных механизмов MS Windows 7\nDEP/Permanent DEP\nASLR\nstack canary\nsafeSEH\nКак обходят такую защиту\nНавыки работы с Immunity Debugger и плагином mona.py\nТребования к участникам workshop:\n5 часов\nВсем участникам будет выдан учебный плагин (x32, совместим со всеми браузерами), однако имеются общие требования к платформе и необходимому ПО:\nWindows 7 (32/64)\nIE9\nFireFox\nImmunity debugger\nmona.py\nдоступ к сети Интернет\nMS Paint\nHexEditor","ru_name":"Advanced Exploit Development (x32). Browser Edition","ru_speakers":"Алексей Синцов","day":2,"begintime":"11:00","track":3,"id":60,"name":"Advanced Exploit Development (x32). Browser Edition","description":"The browser is a window into the world of the Internet, so it is not surprising that various adverse figures use the window to climb right into our home. This workshop is designed for those who are interested in understanding how these figures enter the house by exploiting browser (or plugin) vulnerabilities such as a buffer overflow or use-after-free. Furthermore, we will discuss in details how various defense mechanisms that should prevent penetration work and how they are deceived. We will study the types of attacks on the defense mechanisms of OS and software, such as DEP/ASLR/SafeSEH/GS, learn the technique of HeapSpray, and execute arbitrary code to bypass all the protections! All attacks and exploits will be reproduced by participants during the workshop so they can independently evaluate the threats and the real capabilities of such attacks. \n\nIncluded:\nTypical browser bugs (in IE and its plugins)\nWhat is BoF? How to take over?\nRET\nSEH\nvTable\nExploiting plugin vs. exploiting browser\nExploitation\nHeapSpray in IE9\ndefense bypass\nvanilla DEP (IE6-7)\npermanent DEP+ASLR bypass (with the help of non-ASLR module)\nROP (StackPivot)\nGS+DEP+ASLR\nsafeSeh+GS+DEP+ASLR\nASLR bypass (even if ALL modules have ASLR enabled!)\nWhat is UaF? How to take over?\nWhat prevents UaF?\nOther worlds: Firefox/Opera/Safari/Chrome\n\n\nAt all key stages, calc.exe will be obtained. Participants themselves will bypass the defense methods and build exploits. \n\nA participant will receive:\nExploitation in IE\nBuffer overflow in the stack\nUse-After-Free\nSkills of creating weaponized exploits\nUnderstanding the best defenses of MS Windows 7\nDEP/Permanent DEP\nASLR\nstack canary\nsafeSEH\n…and how to bypass it!\nWorking with Immunity Debugger and mona.py\nRequirements for participants to workshop:\n5 hours\nAll participants will receive a training plugin (x32, compatible with all browsers), but there are common requirements for the platform and necessary software:\nWindows 7 (32/64)\nIE9\nFireFox\nImmunity debugger\nmona.py\nInternet connection\nMS Paint\nHexEditor","speakers":"Alexey Sintsov","type":0},{"ru_description":"Браузер — это окно в мир Интернета, поэтому неудивительно, что через окно различные неблагоприятные элементы лезут прямо в наш дом. Данный курс рассчитан на тех, кому интересно понять, как эти элементы проникают в дом, эксплуатируя такие уязвимости браузера (или его плагинов), как переполнение буфера или использование памяти после освобождения. Кроме того, будет рассмотрено в деталях, как работают и обманываются различные защитные механизмы, которые должны препятствовать проникновению. Мы изучим типовые атаки на защитные механизмы ОС и ПО, такие как DEP/ASLR/SafeSEH/GS, рассмотрим технику HeapSpray и выполним произвольный код в обход всех защит! Все атаки и эксплойты будут воспроизведены участниками в ходе воркшопа, что позволит им самостоятельно оценить угрозы и реальные возможности подобных атак. \n\nВ программу входит:\nТиповые проблемы браузера (на примере IE и его плагинов)\nЧто такое BoF, и как взять контроль?\nRET\nSEH\nvTable\nЧем эксплуатация уязвимостей плагинов отличается от эксплуатации уязвимостей самого браузера?\nОсобенности эксплуатации (чем отличается от серверного ПО, других браузеров)\nHeapSpray in IE9\nобход защитных механизмов\nванильный DEP (IE6-7)\nобход permanent DEP+ASLR (если есть модуль без поддержки ASLR)\nROP (StackPivot)\nGS+DEP+ASLR\nsafeSeh+GS+DEP+ASLR\nобход ASLR (даже если все модули с поддержкой ASLR!)\nЧто такое UaF, и как взять контроль?\nЧто мешает UaF?\nОтличия от Firefox/Opera/Safari/Chrome\n\n\nНа всех ключевых этапах будет получен calc.exe, то есть участники сами будут обходить защитные методы и собирать эксплойты — для этого будут подробно разобраны необходимые детали и суть атак. \n\nУчастник получит:\nПринципы эксплуатации уязвимостей в браузере IE\nПереполнение буфера в стеке\nИспользование памяти после освобождения\nНавыки создания боевых эксплойтов для браузера\nПонимания принципа работы передовых защитных механизмов MS Windows 7\nDEP/Permanent DEP\nASLR\nstack canary\nsafeSEH\nКак обходят такую защиту\nНавыки работы с Immunity Debugger и плагином mona.py\nТребования к участникам workshop:\n5 часов\nВсем участникам будет выдан учебный плагин (x32, совместим со всеми браузерами), однако имеются общие требования к платформе и необходимому ПО:\nWindows 7 (32/64)\nIE9\nFireFox\nImmunity debugger\nmona.py\nдоступ к сети Интернет\nMS Paint\nHexEditor","ru_name":"Advanced Exploit Development (x32). Browser Edition","ru_speakers":"Алексей Синцов","day":2,"begintime":"14:30","track":3,"id":61,"name":"Advanced Exploit Development (x32). Browser Edition","description":"The browser is a window into the world of the Internet, so it is not surprising that various adverse figures use the window to climb right into our home. This workshop is designed for those who are interested in understanding how these figures enter the house by exploiting browser (or plugin) vulnerabilities such as a buffer overflow or use-after-free. Furthermore, we will discuss in details how various defense mechanisms that should prevent penetration work and how they are deceived. We will study the types of attacks on the defense mechanisms of OS and software, such as DEP/ASLR/SafeSEH/GS, learn the technique of HeapSpray, and execute arbitrary code to bypass all the protections! All attacks and exploits will be reproduced by participants during the workshop so they can independently evaluate the threats and the real capabilities of such attacks. \n\nIncluded:\nTypical browser bugs (in IE and its plugins)\nWhat is BoF? How to take over?\nRET\nSEH\nvTable\nExploiting plugin vs. exploiting browser\nExploitation\nHeapSpray in IE9\ndefense bypass\nvanilla DEP (IE6-7)\npermanent DEP+ASLR bypass (with the help of non-ASLR module)\nROP (StackPivot)\nGS+DEP+ASLR\nsafeSeh+GS+DEP+ASLR\nASLR bypass (even if ALL modules have ASLR enabled!)\nWhat is UaF? How to take over?\nWhat prevents UaF?\nOther worlds: Firefox/Opera/Safari/Chrome\n\n\nAt all key stages, calc.exe will be obtained. Participants themselves will bypass the defense methods and build exploits. \n\nA participant will receive:\nExploitation in IE\nBuffer overflow in the stack\nUse-After-Free\nSkills of creating weaponized exploits\nUnderstanding the best defenses of MS Windows 7\nDEP/Permanent DEP\nASLR\nstack canary\nsafeSEH\n…and how to bypass it!\nWorking with Immunity Debugger and mona.py\nRequirements for participants to workshop:\n5 hours\nAll participants will receive a training plugin (x32, compatible with all browsers), but there are common requirements for the platform and necessary software:\nWindows 7 (32/64)\nIE9\nFireFox\nImmunity debugger\nmona.py\nInternet connection\nMS Paint\nHexEditor","speakers":"Alexey SIntsov","type":0},{"ru_description":"Браузер — это окно в мир Интернета, поэтому неудивительно, что через окно различные неблагоприятные элементы лезут прямо в наш дом. Данный курс рассчитан на тех, кому интересно понять, как эти элементы проникают в дом, эксплуатируя такие уязвимости браузера (или его плагинов), как переполнение буфера или использование памяти после освобождения. Кроме того, будет рассмотрено в деталях, как работают и обманываются различные защитные механизмы, которые должны препятствовать проникновению. Мы изучим типовые атаки на защитные механизмы ОС и ПО, такие как DEP/ASLR/SafeSEH/GS, рассмотрим технику HeapSpray и выполним произвольный код в обход всех защит! Все атаки и эксплойты будут воспроизведены участниками в ходе воркшопа, что позволит им самостоятельно оценить угрозы и реальные возможности подобных атак. \n\nВ программу входит:\nТиповые проблемы браузера (на примере IE и его плагинов)\nЧто такое BoF, и как взять контроль?\nRET\nSEH\nvTable\nЧем эксплуатация уязвимостей плагинов отличается от эксплуатации уязвимостей самого браузера?\nОсобенности эксплуатации (чем отличается от серверного ПО, других браузеров)\nHeapSpray in IE9\nобход защитных механизмов\nванильный DEP (IE6-7)\nобход permanent DEP+ASLR (если есть модуль без поддержки ASLR)\nROP (StackPivot)\nGS+DEP+ASLR\nsafeSeh+GS+DEP+ASLR\nобход ASLR (даже если все модули с поддержкой ASLR!)\nЧто такое UaF, и как взять контроль?\nЧто мешает UaF?\nОтличия от Firefox/Opera/Safari/Chrome\n\n\nНа всех ключевых этапах будет получен calc.exe, то есть участники сами будут обходить защитные методы и собирать эксплойты — для этого будут подробно разобраны необходимые детали и суть атак. \n\nУчастник получит:\nПринципы эксплуатации уязвимостей в браузере IE\nПереполнение буфера в стеке\nИспользование памяти после освобождения\nНавыки создания боевых эксплойтов для браузера\nПонимания принципа работы передовых защитных механизмов MS Windows 7\nDEP/Permanent DEP\nASLR\nstack canary\nsafeSEH\nКак обходят такую защиту\nНавыки работы с Immunity Debugger и плагином mona.py\nТребования к участникам workshop:\n5 часов\nВсем участникам будет выдан учебный плагин (x32, совместим со всеми браузерами), однако имеются общие требования к платформе и необходимому ПО:\nWindows 7 (32/64)\nIE9\nFireFox\nImmunity debugger\nmona.py\nдоступ к сети Интернет\nMS Paint\nHexEditor","ru_name":"Advanced Exploit Development (x32). Browser Edition","ru_speakers":"Алексей Синцов","day":2,"begintime":"16:30","track":3,"id":62,"name":"Advanced Exploit Development (x32). Browser Edition","description":"The browser is a window into the world of the Internet, so it is not surprising that various adverse figures use the window to climb right into our home. This workshop is designed for those who are interested in understanding how these figures enter the house by exploiting browser (or plugin) vulnerabilities such as a buffer overflow or use-after-free. Furthermore, we will discuss in details how various defense mechanisms that should prevent penetration work and how they are deceived. We will study the types of attacks on the defense mechanisms of OS and software, such as DEP/ASLR/SafeSEH/GS, learn the technique of HeapSpray, and execute arbitrary code to bypass all the protections! All attacks and exploits will be reproduced by participants during the workshop so they can independently evaluate the threats and the real capabilities of such attacks. \n\nIncluded:\nTypical browser bugs (in IE and its plugins)\nWhat is BoF? How to take over?\nRET\nSEH\nvTable\nExploiting plugin vs. exploiting browser\nExploitation\nHeapSpray in IE9\ndefense bypass\nvanilla DEP (IE6-7)\npermanent DEP+ASLR bypass (with the help of non-ASLR module)\nROP (StackPivot)\nGS+DEP+ASLR\nsafeSeh+GS+DEP+ASLR\nASLR bypass (even if ALL modules have ASLR enabled!)\nWhat is UaF? How to take over?\nWhat prevents UaF?\nOther worlds: Firefox/Opera/Safari/Chrome\n\n\nAt all key stages, calc.exe will be obtained. Participants themselves will bypass the defense methods and build exploits. \n\nA participant will receive:\nExploitation in IE\nBuffer overflow in the stack\nUse-After-Free\nSkills of creating weaponized exploits\nUnderstanding the best defenses of MS Windows 7\nDEP/Permanent DEP\nASLR\nstack canary\nsafeSEH\n…and how to bypass it!\nWorking with Immunity Debugger and mona.py\nRequirements for participants to workshop:\n5 hours\nAll participants will receive a training plugin (x32, compatible with all browsers), but there are common requirements for the platform and necessary software:\nWindows 7 (32/64)\nIE9\nFireFox\nImmunity debugger\nmona.py\nInternet connection\nMS Paint\nHexEditor","speakers":"Alexey SIntsov","type":0},{"ru_description":null,"ru_name":"Кофе-брейк","ru_speakers":null,"day":2,"begintime":"18:00","track":3,"id":63,"name":"Coffe break","description":null,"speakers":null,"type":0},{"ru_description":"В ходе анализа работы George Argyros и Aggelos Kiayias, представленной на BlackHat 2012 было обнаружено, что генераторы псевдослучайных чисел, используемые в PHP, очень даже «псевдо». В результате был создан набор инструментов для реализации атак на генераторы сессий и других элементов защиты в PHP. Также были подготовлены эксплойты для проведения данного вида атак на последние версии различных популярных веб-приложений. \n\nВ рамках workshop будут представлены:\nтеоретические выкладки о механизмах создании сессий и инициализации/использования генератора псевдослучайных чисел в различных версиях PHP;\nпрактическая реализация атак предугадывания случайных токенов сброса пароля и случайных новых паролей, и утилита PHPSESSID Seed Bruteforce, осуществляющая атаку на генератор случайных чисел;\nуязвимости в последних версиях веб-приложений UMI.CMS, OpenCart, Data Life Engine;\nрекомендации для разработчиков, позволяющие избежать подобных проблем.\nТребования к участникам workshop:\nКомпьютер с VMware Player 5\n2 часа времени","ru_name":"Случайные числа. Take Two","ru_speakers":"Арсений Реутов, Тимур Юнусов, Дмитрий Нагибин","day":2,"begintime":"11:00","track":4,"id":64,"name":"Random Numbers. Take Two","description":"At BlackHat 2012, George Argyros and Aggelos Kiayias presented their research concerning attacks on random number generator in PHP, which shows the pseudoness of the random numbers. We have conducted our own research which led to the creation of a program to attack session generators and other PHP defense mechanisms. We have also prepared some exploits to conduct such attacks on the latest versions of popular web applications. \n\nThe workshop will feature:\nthe theory of session creation and initialization/performance of pseudo random number generator in various PHP versions\nthe practice of attacks involving guessing of random password reset tokens and random new passwords as well as the PHPSESSID Seed Bruteforce utility which attacks the random number generator\nvulnerabilities in the latest versions of UMI.CMS, OpenCart, Data Life Engine\nrecommendations for developers on how to prevent such problems\nRequirements for participants to workshop:\nComputer with VMware Player 5.","speakers":"Arseny Reutov, Timur Yunusov, Dmitry  Nagibin","type":0},{"ru_description":"Мы расскажем о двух инструментах для поиска ошибок в программах:\n\nAddressSanitizer и ThreadSanitizer, остановимся на их устройстве и том, какую пользу они могут принести в промышленной разработке и поиске уязвимостей.\n\nБудут продемонстрированы известные ошибки (buffer overflow, use-after-free, race conditions) в opensource-проектах, их влияние на стабильность и безопасность работы программ, и то, как их можно было бы избежать.\n\n\nВ программу входит: обзор ошибок доступа к памяти и синхронизации, их влияние на стабильность и безопасность работы программ\nустройство двух инструментов для поиска таких ошибок, AddressSanitizer и ThreadSanitizer, их преимущества и недостатки\nприменение ASan/TSan по обе сторон баррикад\nпрактическая часть\nТребования к участникам workshop:\n2 часа времени\nноутбук с Linux (64 бита, можно VM)","ru_name":"Предупрежден — значит вооружен: AddressSanitizer и ThreadSanitizer","ru_speakers":"Александр Потапенко, Дмитрий Вьюков","day":2,"begintime":"14:30","track":4,"id":65,"name":"Forewarned is forearmed: AddressSanitizer and ThreadSanitizer","description":"We'll talk about two bug-hunting tools, AddressSanitizer and ThreadSanitizer, describe their design and their applications to industrial development and vulnerability testing.\n\nThe workshop will feature some known bugs (buffer overflows, use-after-free, race conditions) in opensource projects and their impact on program stability and security. We'll also show how those bugs could've been prevented.\n\n\n\nAgenda:\nreview of memory and synchronization errors; their impact on software stability and security\nstructure of two tools which search for those errors: AddressSanitizer and ThreadSanitizer; their benefits and drawbacks\nhow to use ASan/TSan on both sides of the fence\npractice\nRequirements for participants to workshop:\n2 hours\na laptop with Linux (64x, possibly on a VM)","speakers":"Alexander Potapenko, Dmitry Vyukov","type":0},{"ru_description":"Редко встречаются банковские трояны такого размера и сложности, как Win32/SpyEye. И все же в прошлом году был обнаружен Win32/Gataka — банковский троян, который умеет внедрять содержимое в HTML-страницы и имеет модульную архитектуру, которая легко расширяется с помощью плагинов. Установленная на компьютер жертвы, Win32/Gataka может использоваться оператором ботнета для кражи персональных данных. На данный момент известно, что с ее помощью были украдены банковские аутентификационные данные в различных странах, например в Германии, Голландии и Австралии.\n\nВ нашем воркшопе представлена история открытия этого банковского трояна, его внутренняя структура и его сходство с другим хорошо известным банковским трояном — Win32/SpyEye. Помимо прочего, у них одинаковый синтаксис конфигурационного файла веб-инъекций. Это хороший пример узкой специализации для разработчика вирусов: файлы веб-инъекций, направленных на конкретные типы данных, совместимы с различными платформами разработки вредоносного ПО.\n\nМы также обсудим продвинутые файлы конфигурации веб-инъекций и расскажем, как скрипты из этих файлов могут использоваться для автоматизированных краж персональных данных и/или попыток мошеннических банковских переводов. Наконец, мы расскажем о некоторых кампаниях, которые нам удалось отследить за последний год, и покажем, как новые типы вредоносного ПО атакуют государственные учреждения и обходят разнообразные механизмы двухфакторной аутентификации. В воркшоп включены сеансы обратной инженерии, которые помогут вам лучше понять некоторые этапы анализа обсуждаемой угрозы.\n\nДругие названия трояна: Tatanga, Hermes.\n\nТребования к участникам workshop:\n2 часа\nImmunity Debugger (установленный на Windows VM)\nIDA Pro 6.1 или IDA free (установленная на Windows VM)","ru_name":"Ревёрсим банковский троян: взгляд вглубь Гаттаки","ru_speakers":"Jean-Ian Boutin","day":2,"begintime":"16:30","track":4,"id":66,"name":"Reversing banking trojan: an in-depth look into Gataka","description":"Seldom do we see a new banking Trojan with the size and complexity of Win32/SpyEye appearing. This happened last year with the discovery of Win32/Gataka: a banking Trojan able to inject content in HTML pages and exhibiting a modular architecture easily extensible with plugins. Once installed on a computer, Win32/Gataka can be used by botnet operators to steal personal information. As of now, it has been used to steal banking credentials in various countries such as Germany, the Netherlands and Australia.\n\nThe workshop documents the discovery of this banking Trojan along with its internal design and its similarities with another well-known banking Trojan: Win32/SpyEye. Among other things, both share the same webinject configuration file syntax. This is a good example of malware writer specialization: webinject file targeting specific institutions are interoperable between different malware platforms. Advanced webinject configuration file and how scripts contained in these files can be used to automatically steal personal information and/or attempt fraudulent bank transfers will also be discussed. Finally, we will go over some of the campaigns we have tracked in the past year and show how this new strain of malware is targeting national institutions and how it is evading different two-factor authentication processes. Throughout the workshop, we will have reversing sessions that will highlight some of the steps needed to analyze this threat.\n\nAliases: Tatanga, Hermes.\n\nRequirements for participants to workshop:\n2 hours\nImmunity Debugger (Installed on Windows VM)\nIDA Pro 6.1 or IDA free (Installed on Windows VM)","speakers":"Jean-Ian Boutin","type":0},{"ru_description":null,"ru_name":"Кофе-брейк","ru_speakers":null,"day":2,"begintime":"18:05","track":4,"id":67,"name":"Coffe break\n","description":null,"speakers":null,"type":0}]
